<abi-corpus path='libnvpair.so' architecture='elf-amd-x86_64' soname='libnvpair.so.3'>
  <elf-needed>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dump_nvlist' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_byte' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_byte_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_int16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='nvpair_value_nvlist' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_nvlist_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_string_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint16_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint32_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint64_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint8_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='aok' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_alloc_nosleep' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_alloc_nosleep_def' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_alloc_sleep' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_alloc_sleep_def' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_fixed_ops' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_fixed_ops_def' size='40' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvlist_hashtable_init_size' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_max_recursion' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='../../module/nvpair/fnvpair.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair' language='LANG_C89'>
    <function-decl name='fnvlist_alloc' mangled-name='fnvlist_alloc' filepath='../../module/nvpair/fnvpair.c' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_alloc'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_free' mangled-name='fnvlist_free' filepath='../../module/nvpair/fnvpair.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_free'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='59' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_size' mangled-name='fnvlist_size' filepath='../../module/nvpair/fnvpair.c' line='65' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_size'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='65' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='fnvlist_pack' mangled-name='fnvlist_pack' filepath='../../module/nvpair/fnvpair.c' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_pack'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='77' column='1'/>
      <parameter type-id='type-id-4' name='sizep' filepath='../../module/nvpair/fnvpair.c' line='77' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvlist_pack_free' mangled-name='fnvlist_pack_free' filepath='../../module/nvpair/fnvpair.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_pack_free'>
      <parameter type-id='type-id-5' name='pack' filepath='../../module/nvpair/fnvpair.c' line='87' column='1'/>
      <parameter type-id='type-id-3' name='size' filepath='../../module/nvpair/fnvpair.c' line='87' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_unpack' mangled-name='fnvlist_unpack' filepath='../../module/nvpair/fnvpair.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_unpack'>
      <parameter type-id='type-id-5' name='buf' filepath='../../module/nvpair/fnvpair.c' line='97' column='1'/>
      <parameter type-id='type-id-3' name='buflen' filepath='../../module/nvpair/fnvpair.c' line='97' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_dup' mangled-name='fnvlist_dup' filepath='../../module/nvpair/fnvpair.c' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_dup'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='105' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_merge' mangled-name='fnvlist_merge' filepath='../../module/nvpair/fnvpair.c' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_merge'>
      <parameter type-id='type-id-1' name='dst' filepath='../../module/nvpair/fnvpair.c' line='113' column='1'/>
      <parameter type-id='type-id-1' name='src' filepath='../../module/nvpair/fnvpair.c' line='113' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_num_pairs' mangled-name='fnvlist_num_pairs' filepath='../../module/nvpair/fnvpair.c' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_num_pairs'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='119' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean' mangled-name='fnvlist_add_boolean' filepath='../../module/nvpair/fnvpair.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_boolean'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='131' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='131' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean_value' mangled-name='fnvlist_add_boolean_value' filepath='../../module/nvpair/fnvpair.c' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_boolean_value'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='137' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='137' column='1'/>
      <parameter type-id='type-id-7' name='val' filepath='../../module/nvpair/fnvpair.c' line='137' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_byte' mangled-name='fnvlist_add_byte' filepath='../../module/nvpair/fnvpair.c' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_byte'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='143' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='143' column='1'/>
      <parameter type-id='type-id-8' name='val' filepath='../../module/nvpair/fnvpair.c' line='143' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int8' mangled-name='fnvlist_add_int8' filepath='../../module/nvpair/fnvpair.c' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='149' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='149' column='1'/>
      <parameter type-id='type-id-9' name='val' filepath='../../module/nvpair/fnvpair.c' line='149' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint8' mangled-name='fnvlist_add_uint8' filepath='../../module/nvpair/fnvpair.c' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='155' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='155' column='1'/>
      <parameter type-id='type-id-10' name='val' filepath='../../module/nvpair/fnvpair.c' line='155' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int16' mangled-name='fnvlist_add_int16' filepath='../../module/nvpair/fnvpair.c' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='161' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='161' column='1'/>
      <parameter type-id='type-id-11' name='val' filepath='../../module/nvpair/fnvpair.c' line='161' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint16' mangled-name='fnvlist_add_uint16' filepath='../../module/nvpair/fnvpair.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='167' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='167' column='1'/>
      <parameter type-id='type-id-12' name='val' filepath='../../module/nvpair/fnvpair.c' line='167' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int32' mangled-name='fnvlist_add_int32' filepath='../../module/nvpair/fnvpair.c' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='173' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='173' column='1'/>
      <parameter type-id='type-id-13' name='val' filepath='../../module/nvpair/fnvpair.c' line='173' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint32' mangled-name='fnvlist_add_uint32' filepath='../../module/nvpair/fnvpair.c' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='179' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='179' column='1'/>
      <parameter type-id='type-id-14' name='val' filepath='../../module/nvpair/fnvpair.c' line='179' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int64' mangled-name='fnvlist_add_int64' filepath='../../module/nvpair/fnvpair.c' line='185' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='185' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='185' column='1'/>
      <parameter type-id='type-id-15' name='val' filepath='../../module/nvpair/fnvpair.c' line='185' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64' mangled-name='fnvlist_add_uint64' filepath='../../module/nvpair/fnvpair.c' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='191' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='191' column='1'/>
      <parameter type-id='type-id-16' name='val' filepath='../../module/nvpair/fnvpair.c' line='191' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_string' mangled-name='fnvlist_add_string' filepath='../../module/nvpair/fnvpair.c' line='197' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_string'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='197' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='197' column='1'/>
      <parameter type-id='type-id-6' name='val' filepath='../../module/nvpair/fnvpair.c' line='197' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist' mangled-name='fnvlist_add_nvlist' filepath='../../module/nvpair/fnvpair.c' line='203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_nvlist'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='203' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='203' column='1'/>
      <parameter type-id='type-id-1' name='val' filepath='../../module/nvpair/fnvpair.c' line='203' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvpair' mangled-name='fnvlist_add_nvpair' filepath='../../module/nvpair/fnvpair.c' line='209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_nvpair'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='209' column='1'/>
      <parameter type-id='type-id-17' name='pair' filepath='../../module/nvpair/fnvpair.c' line='209' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean_array' mangled-name='fnvlist_add_boolean_array' filepath='../../module/nvpair/fnvpair.c' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_boolean_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='215' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='215' column='1'/>
      <parameter type-id='type-id-18' name='val' filepath='../../module/nvpair/fnvpair.c' line='216' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='216' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_byte_array' mangled-name='fnvlist_add_byte_array' filepath='../../module/nvpair/fnvpair.c' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_byte_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='222' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='222' column='1'/>
      <parameter type-id='type-id-20' name='val' filepath='../../module/nvpair/fnvpair.c' line='222' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='222' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int8_array' mangled-name='fnvlist_add_int8_array' filepath='../../module/nvpair/fnvpair.c' line='228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='228' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='228' column='1'/>
      <parameter type-id='type-id-21' name='val' filepath='../../module/nvpair/fnvpair.c' line='228' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='228' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint8_array' mangled-name='fnvlist_add_uint8_array' filepath='../../module/nvpair/fnvpair.c' line='234' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='234' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='234' column='1'/>
      <parameter type-id='type-id-22' name='val' filepath='../../module/nvpair/fnvpair.c' line='234' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='234' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int16_array' mangled-name='fnvlist_add_int16_array' filepath='../../module/nvpair/fnvpair.c' line='240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='240' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='240' column='1'/>
      <parameter type-id='type-id-23' name='val' filepath='../../module/nvpair/fnvpair.c' line='240' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='240' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint16_array' mangled-name='fnvlist_add_uint16_array' filepath='../../module/nvpair/fnvpair.c' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='246' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='246' column='1'/>
      <parameter type-id='type-id-24' name='val' filepath='../../module/nvpair/fnvpair.c' line='247' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='247' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int32_array' mangled-name='fnvlist_add_int32_array' filepath='../../module/nvpair/fnvpair.c' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='253' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='253' column='1'/>
      <parameter type-id='type-id-25' name='val' filepath='../../module/nvpair/fnvpair.c' line='253' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='253' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint32_array' mangled-name='fnvlist_add_uint32_array' filepath='../../module/nvpair/fnvpair.c' line='259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='259' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='259' column='1'/>
      <parameter type-id='type-id-26' name='val' filepath='../../module/nvpair/fnvpair.c' line='260' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='260' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int64_array' mangled-name='fnvlist_add_int64_array' filepath='../../module/nvpair/fnvpair.c' line='266' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='266' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='266' column='1'/>
      <parameter type-id='type-id-27' name='val' filepath='../../module/nvpair/fnvpair.c' line='266' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='266' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64_array' mangled-name='fnvlist_add_uint64_array' filepath='../../module/nvpair/fnvpair.c' line='272' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='272' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='272' column='1'/>
      <parameter type-id='type-id-28' name='val' filepath='../../module/nvpair/fnvpair.c' line='273' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='273' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_string_array' mangled-name='fnvlist_add_string_array' filepath='../../module/nvpair/fnvpair.c' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_string_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='279' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='279' column='1'/>
      <parameter type-id='type-id-29' name='val' filepath='../../module/nvpair/fnvpair.c' line='280' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='280' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist_array' mangled-name='fnvlist_add_nvlist_array' filepath='../../module/nvpair/fnvpair.c' line='286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_nvlist_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='286' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='286' column='1'/>
      <parameter type-id='type-id-30' name='val' filepath='../../module/nvpair/fnvpair.c' line='287' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='287' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_remove' mangled-name='fnvlist_remove' filepath='../../module/nvpair/fnvpair.c' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_remove'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='293' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='293' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_remove_nvpair' mangled-name='fnvlist_remove_nvpair' filepath='../../module/nvpair/fnvpair.c' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_remove_nvpair'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='299' column='1'/>
      <parameter type-id='type-id-17' name='pair' filepath='../../module/nvpair/fnvpair.c' line='299' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvpair' mangled-name='fnvlist_lookup_nvpair' filepath='../../module/nvpair/fnvpair.c' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_nvpair'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='305' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='305' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean' mangled-name='fnvlist_lookup_boolean' filepath='../../module/nvpair/fnvpair.c' line='314' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_boolean'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='314' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='314' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean_value' mangled-name='fnvlist_lookup_boolean_value' filepath='../../module/nvpair/fnvpair.c' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_boolean_value'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='320' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='320' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_byte' mangled-name='fnvlist_lookup_byte' filepath='../../module/nvpair/fnvpair.c' line='328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_byte'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='328' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='328' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int8' mangled-name='fnvlist_lookup_int8' filepath='../../module/nvpair/fnvpair.c' line='336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='336' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='336' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int16' mangled-name='fnvlist_lookup_int16' filepath='../../module/nvpair/fnvpair.c' line='344' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='344' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='344' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int32' mangled-name='fnvlist_lookup_int32' filepath='../../module/nvpair/fnvpair.c' line='352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='352' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='352' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int64' mangled-name='fnvlist_lookup_int64' filepath='../../module/nvpair/fnvpair.c' line='360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='360' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='360' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint8' mangled-name='fnvlist_lookup_uint8' filepath='../../module/nvpair/fnvpair.c' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='368' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='368' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint16' mangled-name='fnvlist_lookup_uint16' filepath='../../module/nvpair/fnvpair.c' line='376' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='376' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='376' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint32' mangled-name='fnvlist_lookup_uint32' filepath='../../module/nvpair/fnvpair.c' line='384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='384' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='384' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint64' mangled-name='fnvlist_lookup_uint64' filepath='../../module/nvpair/fnvpair.c' line='392' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='392' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='392' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_string' mangled-name='fnvlist_lookup_string' filepath='../../module/nvpair/fnvpair.c' line='400' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_string'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='400' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='400' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvlist' mangled-name='fnvlist_lookup_nvlist' filepath='../../module/nvpair/fnvpair.c' line='408' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_nvlist'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='408' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='408' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean_array' mangled-name='fnvlist_lookup_boolean_array' filepath='../../module/nvpair/fnvpair.c' line='415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_boolean_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='415' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='415' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='415' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_byte_array' mangled-name='fnvlist_lookup_byte_array' filepath='../../module/nvpair/fnvpair.c' line='423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_byte_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='423' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='423' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='423' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int8_array' mangled-name='fnvlist_lookup_int8_array' filepath='../../module/nvpair/fnvpair.c' line='431' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='431' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='431' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='431' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint8_array' mangled-name='fnvlist_lookup_uint8_array' filepath='../../module/nvpair/fnvpair.c' line='439' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='439' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='439' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='439' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int16_array' mangled-name='fnvlist_lookup_int16_array' filepath='../../module/nvpair/fnvpair.c' line='447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='447' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='447' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='447' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint16_array' mangled-name='fnvlist_lookup_uint16_array' filepath='../../module/nvpair/fnvpair.c' line='455' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='455' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='455' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='455' column='1'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int32_array' mangled-name='fnvlist_lookup_int32_array' filepath='../../module/nvpair/fnvpair.c' line='463' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='463' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='463' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='463' column='1'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint32_array' mangled-name='fnvlist_lookup_uint32_array' filepath='../../module/nvpair/fnvpair.c' line='471' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='471' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='471' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='471' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int64_array' mangled-name='fnvlist_lookup_int64_array' filepath='../../module/nvpair/fnvpair.c' line='479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='479' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='479' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='479' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint64_array' mangled-name='fnvlist_lookup_uint64_array' filepath='../../module/nvpair/fnvpair.c' line='487' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='487' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='487' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='487' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-5'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-29'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-6'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-25'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-21'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-1'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-30'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-4'/>
    <typedef-decl name='boolean_t' type-id='type-id-37' filepath='../../lib/libspl/include/sys/stdtypes.h' line='29' column='1' id='type-id-7'/>
    <typedef-decl name='int16_t' type-id='type-id-38' filepath='/usr/include/sys/types.h' line='195' column='1' id='type-id-11'/>
    <typedef-decl name='int32_t' type-id='type-id-39' filepath='/usr/include/sys/types.h' line='196' column='1' id='type-id-13'/>
    <typedef-decl name='int64_t' type-id='type-id-40' filepath='/usr/include/sys/types.h' line='197' column='1' id='type-id-15'/>
    <typedef-decl name='int8_t' type-id='type-id-41' filepath='/usr/include/sys/types.h' line='194' column='1' id='type-id-9'/>
    <typedef-decl name='size_t' type-id='type-id-42' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.8.5/include/stddef.h' line='212' column='1' id='type-id-3'/>
    <typedef-decl name='uchar_t' type-id='type-id-43' filepath='../../lib/libspl/include/sys/stdtypes.h' line='31' column='1' id='type-id-8'/>
    <typedef-decl name='uint16_t' type-id='type-id-44' filepath='/usr/include/stdint.h' line='49' column='1' id='type-id-12'/>
    <typedef-decl name='uint32_t' type-id='type-id-45' filepath='/usr/include/stdint.h' line='51' column='1' id='type-id-14'/>
    <typedef-decl name='uint64_t' type-id='type-id-42' filepath='/usr/include/stdint.h' line='55' column='1' id='type-id-16'/>
    <typedef-decl name='uint8_t' type-id='type-id-43' filepath='/usr/include/stdint.h' line='48' column='1' id='type-id-10'/>
    <typedef-decl name='uint_t' type-id='type-id-45' filepath='../../lib/libspl/include/sys/stdtypes.h' line='33' column='1' id='type-id-19'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-20'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-26'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-28'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-22'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-31'/>
    <type-decl name='void' id='type-id-2'/>
    <type-decl name='char' size-in-bits='8' id='type-id-32'/>
    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-33'/>
    <qualified-type-def type-id='type-id-32' const='yes' id='type-id-34'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../lib/libspl/include/sys/stdtypes.h' line='26' column='1' id='type-id-37'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-39'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-40'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-38'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-41'/>
    <typedef-decl name='nvlist_t' type-id='type-id-47' filepath='../../include/sys/nvpair.h' line='91' column='1' id='type-id-35'/>
    <typedef-decl name='nvpair_t' type-id='type-id-48' filepath='../../include/sys/nvpair.h' line='82' column='1' id='type-id-36'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-43'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-45'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-42'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-44'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='85' column='1' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-13' visibility='default' filepath='../../include/sys/nvpair.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-14' visibility='default' filepath='../../include/sys/nvpair.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-16' visibility='default' filepath='../../include/sys/nvpair.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-14' visibility='default' filepath='../../include/sys/nvpair.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-13' visibility='default' filepath='../../include/sys/nvpair.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='73' column='1' id='type-id-48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='type-id-13' visibility='default' filepath='../../include/sys/nvpair.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='type-id-11' visibility='default' filepath='../../include/sys/nvpair.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='type-id-11' visibility='default' filepath='../../include/sys/nvpair.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='type-id-13' visibility='default' filepath='../../include/sys/nvpair.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='type-id-49' visibility='default' filepath='../../include/sys/nvpair.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='data_type_t' type-id='type-id-50' filepath='../../include/sys/nvpair.h' line='71' column='1' id='type-id-49'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' filepath='../../include/sys/nvpair.h' line='37' column='1' id='type-id-50'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/nvpair/nvpair.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair' language='LANG_C89'>
    <typedef-decl name='bool_t' type-id='type-id-39' filepath='/usr/include/rpc/types.h' line='37' column='1' id='type-id-51'/>
    <class-decl name='XDR' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/rpc/xdr.h' line='110' column='1' id='type-id-52'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x_op' type-id='type-id-53' visibility='default' filepath='/usr/include/rpc/xdr.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='x_ops' type-id='type-id-54' visibility='default' filepath='/usr/include/rpc/xdr.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='x_public' type-id='type-id-55' visibility='default' filepath='/usr/include/rpc/xdr.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='x_private' type-id='type-id-55' visibility='default' filepath='/usr/include/rpc/xdr.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x_base' type-id='type-id-55' visibility='default' filepath='/usr/include/rpc/xdr.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='x_handy' type-id='type-id-56' visibility='default' filepath='/usr/include/rpc/xdr.h' line='140' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='xdr_op' filepath='/usr/include/rpc/xdr.h' line='81' column='1' id='type-id-53'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='XDR_ENCODE' value='0'/>
      <enumerator name='XDR_DECODE' value='1'/>
      <enumerator name='XDR_FREE' value='2'/>
    </enum-decl>
    <class-decl name='xdr_ops' size-in-bits='640' is-struct='yes' visibility='default' filepath='/usr/include/rpc/xdr.h' line='113' column='1' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x_getlong' type-id='type-id-58' visibility='default' filepath='/usr/include/rpc/xdr.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='x_putlong' type-id='type-id-59' visibility='default' filepath='/usr/include/rpc/xdr.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='x_getbytes' type-id='type-id-60' visibility='default' filepath='/usr/include/rpc/xdr.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='x_putbytes' type-id='type-id-61' visibility='default' filepath='/usr/include/rpc/xdr.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x_getpostn' type-id='type-id-62' visibility='default' filepath='/usr/include/rpc/xdr.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='x_setpostn' type-id='type-id-63' visibility='default' filepath='/usr/include/rpc/xdr.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='x_inline' type-id='type-id-64' visibility='default' filepath='/usr/include/rpc/xdr.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='x_destroy' type-id='type-id-65' visibility='default' filepath='/usr/include/rpc/xdr.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='x_getint32' type-id='type-id-66' visibility='default' filepath='/usr/include/rpc/xdr.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='x_putint32' type-id='type-id-67' visibility='default' filepath='/usr/include/rpc/xdr.h' line='133' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='XDR' type-id='type-id-52' filepath='/usr/include/rpc/xdr.h' line='109' column='1' id='type-id-68'/>
    <typedef-decl name='caddr_t' type-id='type-id-69' filepath='/usr/include/sys/types.h' line='116' column='1' id='type-id-55'/>
    <typedef-decl name='__caddr_t' type-id='type-id-5' filepath='/usr/include/bits/types.h' line='192' column='1' id='type-id-69'/>
    <typedef-decl name='u_int' type-id='type-id-70' filepath='/usr/include/sys/types.h' line='35' column='1' id='type-id-56'/>
    <typedef-decl name='__u_int' type-id='type-id-45' filepath='/usr/include/bits/types.h' line='32' column='1' id='type-id-70'/>
    <typedef-decl name='quad_t' type-id='type-id-71' filepath='/usr/include/sys/types.h' line='37' column='1' id='type-id-72'/>
    <typedef-decl name='__quad_t' type-id='type-id-40' filepath='/usr/include/bits/types.h' line='52' column='1' id='type-id-71'/>
    <typedef-decl name='xdrproc_t' type-id='type-id-73' filepath='/usr/include/rpc/xdr.h' line='152' column='1' id='type-id-74'/>
    <typedef-decl name='u_quad_t' type-id='type-id-75' filepath='/usr/include/sys/types.h' line='38' column='1' id='type-id-76'/>
    <typedef-decl name='__u_quad_t' type-id='type-id-42' filepath='/usr/include/bits/types.h' line='53' column='1' id='type-id-75'/>
    <typedef-decl name='u_short' type-id='type-id-77' filepath='/usr/include/sys/types.h' line='34' column='1' id='type-id-78'/>
    <typedef-decl name='__u_short' type-id='type-id-44' filepath='/usr/include/bits/types.h' line='31' column='1' id='type-id-77'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-80'/>
    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-33'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-29'/>
    <qualified-type-def type-id='type-id-68' const='yes' id='type-id-81'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-82'/>
    <qualified-type-def type-id='type-id-55' const='yes' id='type-id-83'/>
    <qualified-type-def type-id='type-id-13' const='yes' id='type-id-84'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-85'/>
    <qualified-type-def type-id='type-id-40' const='yes' id='type-id-86'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-87'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-88'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-64'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-90'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-91'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-92'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-93'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-4'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-61'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-67'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-59'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-58'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-63'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-73'/>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-62'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-103'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-105'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-54'/>
    <function-decl name='nv_alloc_init' mangled-name='nv_alloc_init' filepath='../../module/nvpair/nvpair.c' line='157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nv_alloc_init'>
      <parameter type-id='type-id-107' name='nva' filepath='../../module/nvpair/nvpair.c' line='157' column='1'/>
      <parameter type-id='type-id-108' name='nvo' filepath='../../module/nvpair/nvpair.c' line='157' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nv_alloc_reset' mangled-name='nv_alloc_reset' filepath='../../module/nvpair/nvpair.c' line='174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nv_alloc_reset'>
      <parameter type-id='type-id-107' name='nva' filepath='../../module/nvpair/nvpair.c' line='174' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nv_alloc_fini' mangled-name='nv_alloc_fini' filepath='../../module/nvpair/nvpair.c' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nv_alloc_fini'>
      <parameter type-id='type-id-107' name='nva' filepath='../../module/nvpair/nvpair.c' line='181' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nv_alloc' mangled-name='nvlist_lookup_nv_alloc' filepath='../../module/nvpair/nvpair.c' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nv_alloc'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='188' column='1'/>
      <return type-id='type-id-107'/>
    </function-decl>
    <function-decl name='nvlist_nvflag' mangled-name='nvlist_nvflag' filepath='../../module/nvpair/nvpair.c' line='559' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_nvflag'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='559' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='nvlist_xalloc' mangled-name='nvlist_xalloc' filepath='../../module/nvpair/nvpair.c' line='591' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xalloc'>
      <parameter type-id='type-id-30' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='591' column='1'/>
      <parameter type-id='type-id-19' name='nvflag' filepath='../../module/nvpair/nvpair.c' line='591' column='1'/>
      <parameter type-id='type-id-107' name='nva' filepath='../../module/nvpair/nvpair.c' line='591' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_alloc' mangled-name='nvlist_alloc' filepath='../../module/nvpair/nvpair.c' line='585' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_alloc'>
      <parameter type-id='type-id-30' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='585' column='1'/>
      <parameter type-id='type-id-19' name='nvflag' filepath='../../module/nvpair/nvpair.c' line='585' column='1'/>
      <parameter type-id='type-id-39' name='kmflag' filepath='../../module/nvpair/nvpair.c' line='585' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_free' mangled-name='nvlist_free' filepath='../../module/nvpair/nvpair.c' line='866' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_free'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='866' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_remove_nvpair' mangled-name='nvlist_remove_nvpair' filepath='../../module/nvpair/nvpair.c' line='978' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_remove_nvpair'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='978' column='1'/>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='978' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_remove_all' mangled-name='nvlist_remove_all' filepath='../../module/nvpair/nvpair.c' line='945' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_remove_all'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='945' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='945' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_remove' mangled-name='nvlist_remove' filepath='../../module/nvpair/nvpair.c' line='965' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_remove'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='965' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='965' column='1'/>
      <parameter type-id='type-id-49' name='type' filepath='../../module/nvpair/nvpair.c' line='965' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_xdup' mangled-name='nvlist_xdup' filepath='../../module/nvpair/nvpair.c' line='922' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xdup'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='922' column='1'/>
      <parameter type-id='type-id-30' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='922' column='1'/>
      <parameter type-id='type-id-107' name='nva' filepath='../../module/nvpair/nvpair.c' line='922' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_dup' mangled-name='nvlist_dup' filepath='../../module/nvpair/nvpair.c' line='916' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_dup'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='916' column='1'/>
      <parameter type-id='type-id-30' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='916' column='1'/>
      <parameter type-id='type-id-39' name='kmflag' filepath='../../module/nvpair/nvpair.c' line='916' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean' mangled-name='nvlist_add_boolean' filepath='../../module/nvpair/nvpair.c' line='1276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_boolean'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1276' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1276' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean_value' mangled-name='nvlist_add_boolean_value' filepath='../../module/nvpair/nvpair.c' line='1282' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_boolean_value'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1282' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1282' column='1'/>
      <parameter type-id='type-id-7' name='val' filepath='../../module/nvpair/nvpair.c' line='1282' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_byte' mangled-name='nvlist_add_byte' filepath='../../module/nvpair/nvpair.c' line='1288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_byte'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1288' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1288' column='1'/>
      <parameter type-id='type-id-8' name='val' filepath='../../module/nvpair/nvpair.c' line='1288' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_int8' mangled-name='nvlist_add_int8' filepath='../../module/nvpair/nvpair.c' line='1294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1294' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1294' column='1'/>
      <parameter type-id='type-id-9' name='val' filepath='../../module/nvpair/nvpair.c' line='1294' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_uint8' mangled-name='nvlist_add_uint8' filepath='../../module/nvpair/nvpair.c' line='1300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1300' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1300' column='1'/>
      <parameter type-id='type-id-10' name='val' filepath='../../module/nvpair/nvpair.c' line='1300' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_int16' mangled-name='nvlist_add_int16' filepath='../../module/nvpair/nvpair.c' line='1306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1306' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1306' column='1'/>
      <parameter type-id='type-id-11' name='val' filepath='../../module/nvpair/nvpair.c' line='1306' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_uint16' mangled-name='nvlist_add_uint16' filepath='../../module/nvpair/nvpair.c' line='1312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1312' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1312' column='1'/>
      <parameter type-id='type-id-12' name='val' filepath='../../module/nvpair/nvpair.c' line='1312' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_int32' mangled-name='nvlist_add_int32' filepath='../../module/nvpair/nvpair.c' line='1318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1318' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1318' column='1'/>
      <parameter type-id='type-id-13' name='val' filepath='../../module/nvpair/nvpair.c' line='1318' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_uint32' mangled-name='nvlist_add_uint32' filepath='../../module/nvpair/nvpair.c' line='1324' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1324' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1324' column='1'/>
      <parameter type-id='type-id-14' name='val' filepath='../../module/nvpair/nvpair.c' line='1324' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_int64' mangled-name='nvlist_add_int64' filepath='../../module/nvpair/nvpair.c' line='1330' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1330' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1330' column='1'/>
      <parameter type-id='type-id-15' name='val' filepath='../../module/nvpair/nvpair.c' line='1330' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64' mangled-name='nvlist_add_uint64' filepath='../../module/nvpair/nvpair.c' line='1336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1336' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1336' column='1'/>
      <parameter type-id='type-id-16' name='val' filepath='../../module/nvpair/nvpair.c' line='1336' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_double' mangled-name='nvlist_add_double' filepath='../../module/nvpair/nvpair.c' line='1343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_double'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1343' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1343' column='1'/>
      <parameter type-id='type-id-109' name='val' filepath='../../module/nvpair/nvpair.c' line='1343' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_string' mangled-name='nvlist_add_string' filepath='../../module/nvpair/nvpair.c' line='1350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_string'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1350' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1350' column='1'/>
      <parameter type-id='type-id-6' name='val' filepath='../../module/nvpair/nvpair.c' line='1350' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean_array' mangled-name='nvlist_add_boolean_array' filepath='../../module/nvpair/nvpair.c' line='1356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_boolean_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1356' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1356' column='1'/>
      <parameter type-id='type-id-18' name='a' filepath='../../module/nvpair/nvpair.c' line='1357' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1357' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_byte_array' mangled-name='nvlist_add_byte_array' filepath='../../module/nvpair/nvpair.c' line='1363' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_byte_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1363' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1363' column='1'/>
      <parameter type-id='type-id-20' name='a' filepath='../../module/nvpair/nvpair.c' line='1363' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1363' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_int8_array' mangled-name='nvlist_add_int8_array' filepath='../../module/nvpair/nvpair.c' line='1369' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1369' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1369' column='1'/>
      <parameter type-id='type-id-21' name='a' filepath='../../module/nvpair/nvpair.c' line='1369' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1369' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_uint8_array' mangled-name='nvlist_add_uint8_array' filepath='../../module/nvpair/nvpair.c' line='1375' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1375' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1375' column='1'/>
      <parameter type-id='type-id-22' name='a' filepath='../../module/nvpair/nvpair.c' line='1375' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1375' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_int16_array' mangled-name='nvlist_add_int16_array' filepath='../../module/nvpair/nvpair.c' line='1381' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1381' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1381' column='1'/>
      <parameter type-id='type-id-23' name='a' filepath='../../module/nvpair/nvpair.c' line='1381' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1381' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_uint16_array' mangled-name='nvlist_add_uint16_array' filepath='../../module/nvpair/nvpair.c' line='1387' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1387' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1387' column='1'/>
      <parameter type-id='type-id-24' name='a' filepath='../../module/nvpair/nvpair.c' line='1387' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1387' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_int32_array' mangled-name='nvlist_add_int32_array' filepath='../../module/nvpair/nvpair.c' line='1393' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1393' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1393' column='1'/>
      <parameter type-id='type-id-25' name='a' filepath='../../module/nvpair/nvpair.c' line='1393' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1393' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_uint32_array' mangled-name='nvlist_add_uint32_array' filepath='../../module/nvpair/nvpair.c' line='1399' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1399' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1399' column='1'/>
      <parameter type-id='type-id-26' name='a' filepath='../../module/nvpair/nvpair.c' line='1399' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1399' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_int64_array' mangled-name='nvlist_add_int64_array' filepath='../../module/nvpair/nvpair.c' line='1405' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1405' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1405' column='1'/>
      <parameter type-id='type-id-27' name='a' filepath='../../module/nvpair/nvpair.c' line='1405' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1405' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64_array' mangled-name='nvlist_add_uint64_array' filepath='../../module/nvpair/nvpair.c' line='1411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1411' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1411' column='1'/>
      <parameter type-id='type-id-28' name='a' filepath='../../module/nvpair/nvpair.c' line='1411' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1411' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_string_array' mangled-name='nvlist_add_string_array' filepath='../../module/nvpair/nvpair.c' line='1417' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_string_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1417' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1417' column='1'/>
      <parameter type-id='type-id-29' name='a' filepath='../../module/nvpair/nvpair.c' line='1418' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1418' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_hrtime' mangled-name='nvlist_add_hrtime' filepath='../../module/nvpair/nvpair.c' line='1424' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_hrtime'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1424' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1424' column='1'/>
      <parameter type-id='type-id-110' name='val' filepath='../../module/nvpair/nvpair.c' line='1424' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist' mangled-name='nvlist_add_nvlist' filepath='../../module/nvpair/nvpair.c' line='1430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_nvlist'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1430' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1430' column='1'/>
      <parameter type-id='type-id-1' name='val' filepath='../../module/nvpair/nvpair.c' line='1430' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist_array' mangled-name='nvlist_add_nvlist_array' filepath='../../module/nvpair/nvpair.c' line='1436' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_nvlist_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1436' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1436' column='1'/>
      <parameter type-id='type-id-30' name='a' filepath='../../module/nvpair/nvpair.c' line='1436' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1436' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_prev_nvpair' mangled-name='nvlist_prev_nvpair' filepath='../../module/nvpair/nvpair.c' line='1472' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prev_nvpair'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1472' column='1'/>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='1472' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='nvlist_empty' mangled-name='nvlist_empty' filepath='../../module/nvpair/nvpair.c' line='1496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_empty'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1496' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nvlist_lookup_boolean' mangled-name='nvlist_lookup_boolean' filepath='../../module/nvpair/nvpair.c' line='1636' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_boolean'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1636' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1636' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_boolean_value' mangled-name='nvlist_lookup_boolean_value' filepath='../../module/nvpair/nvpair.c' line='1642' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_boolean_value'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1642' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1642' column='1'/>
      <parameter type-id='type-id-18' name='val' filepath='../../module/nvpair/nvpair.c' line='1642' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_byte' mangled-name='nvlist_lookup_byte' filepath='../../module/nvpair/nvpair.c' line='1649' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_byte'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1649' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1649' column='1'/>
      <parameter type-id='type-id-20' name='val' filepath='../../module/nvpair/nvpair.c' line='1649' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int8' mangled-name='nvlist_lookup_int8' filepath='../../module/nvpair/nvpair.c' line='1655' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1655' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1655' column='1'/>
      <parameter type-id='type-id-21' name='val' filepath='../../module/nvpair/nvpair.c' line='1655' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint8' mangled-name='nvlist_lookup_uint8' filepath='../../module/nvpair/nvpair.c' line='1661' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1661' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1661' column='1'/>
      <parameter type-id='type-id-22' name='val' filepath='../../module/nvpair/nvpair.c' line='1661' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int16' mangled-name='nvlist_lookup_int16' filepath='../../module/nvpair/nvpair.c' line='1667' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1667' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1667' column='1'/>
      <parameter type-id='type-id-23' name='val' filepath='../../module/nvpair/nvpair.c' line='1667' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint16' mangled-name='nvlist_lookup_uint16' filepath='../../module/nvpair/nvpair.c' line='1673' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1673' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1673' column='1'/>
      <parameter type-id='type-id-24' name='val' filepath='../../module/nvpair/nvpair.c' line='1673' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int32' mangled-name='nvlist_lookup_int32' filepath='../../module/nvpair/nvpair.c' line='1679' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1679' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1679' column='1'/>
      <parameter type-id='type-id-25' name='val' filepath='../../module/nvpair/nvpair.c' line='1679' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint32' mangled-name='nvlist_lookup_uint32' filepath='../../module/nvpair/nvpair.c' line='1685' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1685' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1685' column='1'/>
      <parameter type-id='type-id-26' name='val' filepath='../../module/nvpair/nvpair.c' line='1685' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int64' mangled-name='nvlist_lookup_int64' filepath='../../module/nvpair/nvpair.c' line='1691' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1691' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1691' column='1'/>
      <parameter type-id='type-id-27' name='val' filepath='../../module/nvpair/nvpair.c' line='1691' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64' mangled-name='nvlist_lookup_uint64' filepath='../../module/nvpair/nvpair.c' line='1697' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1697' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1697' column='1'/>
      <parameter type-id='type-id-28' name='val' filepath='../../module/nvpair/nvpair.c' line='1697' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_double' mangled-name='nvlist_lookup_double' filepath='../../module/nvpair/nvpair.c' line='1704' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_double'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1704' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1704' column='1'/>
      <parameter type-id='type-id-111' name='val' filepath='../../module/nvpair/nvpair.c' line='1704' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string' mangled-name='nvlist_lookup_string' filepath='../../module/nvpair/nvpair.c' line='1711' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_string'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1711' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1711' column='1'/>
      <parameter type-id='type-id-112' name='val' filepath='../../module/nvpair/nvpair.c' line='1711' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist' mangled-name='nvlist_lookup_nvlist' filepath='../../module/nvpair/nvpair.c' line='1717' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvlist'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1717' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1717' column='1'/>
      <parameter type-id='type-id-30' name='val' filepath='../../module/nvpair/nvpair.c' line='1717' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_boolean_array' mangled-name='nvlist_lookup_boolean_array' filepath='../../module/nvpair/nvpair.c' line='1723' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_boolean_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1723' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1723' column='1'/>
      <parameter type-id='type-id-113' name='a' filepath='../../module/nvpair/nvpair.c' line='1724' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1724' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_byte_array' mangled-name='nvlist_lookup_byte_array' filepath='../../module/nvpair/nvpair.c' line='1731' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_byte_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1731' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1731' column='1'/>
      <parameter type-id='type-id-114' name='a' filepath='../../module/nvpair/nvpair.c' line='1732' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1732' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int8_array' mangled-name='nvlist_lookup_int8_array' filepath='../../module/nvpair/nvpair.c' line='1738' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1738' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1738' column='1'/>
      <parameter type-id='type-id-115' name='a' filepath='../../module/nvpair/nvpair.c' line='1738' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1738' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint8_array' mangled-name='nvlist_lookup_uint8_array' filepath='../../module/nvpair/nvpair.c' line='1744' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1744' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1744' column='1'/>
      <parameter type-id='type-id-116' name='a' filepath='../../module/nvpair/nvpair.c' line='1745' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1745' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int16_array' mangled-name='nvlist_lookup_int16_array' filepath='../../module/nvpair/nvpair.c' line='1751' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1751' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1751' column='1'/>
      <parameter type-id='type-id-117' name='a' filepath='../../module/nvpair/nvpair.c' line='1752' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1752' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint16_array' mangled-name='nvlist_lookup_uint16_array' filepath='../../module/nvpair/nvpair.c' line='1758' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1758' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1758' column='1'/>
      <parameter type-id='type-id-118' name='a' filepath='../../module/nvpair/nvpair.c' line='1759' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1759' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int32_array' mangled-name='nvlist_lookup_int32_array' filepath='../../module/nvpair/nvpair.c' line='1765' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1765' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1765' column='1'/>
      <parameter type-id='type-id-119' name='a' filepath='../../module/nvpair/nvpair.c' line='1766' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1766' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint32_array' mangled-name='nvlist_lookup_uint32_array' filepath='../../module/nvpair/nvpair.c' line='1772' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1772' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1772' column='1'/>
      <parameter type-id='type-id-120' name='a' filepath='../../module/nvpair/nvpair.c' line='1773' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1773' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int64_array' mangled-name='nvlist_lookup_int64_array' filepath='../../module/nvpair/nvpair.c' line='1779' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1779' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1779' column='1'/>
      <parameter type-id='type-id-121' name='a' filepath='../../module/nvpair/nvpair.c' line='1780' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1780' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64_array' mangled-name='nvlist_lookup_uint64_array' filepath='../../module/nvpair/nvpair.c' line='1786' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1786' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1786' column='1'/>
      <parameter type-id='type-id-122' name='a' filepath='../../module/nvpair/nvpair.c' line='1787' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1787' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string_array' mangled-name='nvlist_lookup_string_array' filepath='../../module/nvpair/nvpair.c' line='1793' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_string_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1793' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1793' column='1'/>
      <parameter type-id='type-id-123' name='a' filepath='../../module/nvpair/nvpair.c' line='1794' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1794' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist_array' mangled-name='nvlist_lookup_nvlist_array' filepath='../../module/nvpair/nvpair.c' line='1800' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvlist_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1800' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1800' column='1'/>
      <parameter type-id='type-id-124' name='a' filepath='../../module/nvpair/nvpair.c' line='1801' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1801' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_hrtime' mangled-name='nvlist_lookup_hrtime' filepath='../../module/nvpair/nvpair.c' line='1807' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_hrtime'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1807' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1807' column='1'/>
      <parameter type-id='type-id-125' name='val' filepath='../../module/nvpair/nvpair.c' line='1807' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_pairs' mangled-name='nvlist_lookup_pairs' filepath='../../module/nvpair/nvpair.c' line='1813' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_pairs'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1813' column='1'/>
      <parameter type-id='type-id-39' name='flag' filepath='../../module/nvpair/nvpair.c' line='1813' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_exists' mangled-name='nvlist_exists' filepath='../../module/nvpair/nvpair.c' line='2080' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_exists'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2080' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='2080' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvpair_embedded_index' mangled-name='nvlist_lookup_nvpair_embedded_index' filepath='../../module/nvpair/nvpair.c' line='2073' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvpair_embedded_index'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2073' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='2074' column='1'/>
      <parameter type-id='type-id-91' name='ret' filepath='../../module/nvpair/nvpair.c' line='2074' column='1'/>
      <parameter type-id='type-id-88' name='ip' filepath='../../module/nvpair/nvpair.c' line='2074' column='1'/>
      <parameter type-id='type-id-112' name='ep' filepath='../../module/nvpair/nvpair.c' line='2074' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvpair' mangled-name='nvlist_lookup_nvpair' filepath='../../module/nvpair/nvpair.c' line='2063' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvpair'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2063' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='2063' column='1'/>
      <parameter type-id='type-id-91' name='ret' filepath='../../module/nvpair/nvpair.c' line='2063' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_add_nvpair' mangled-name='nvlist_add_nvpair' filepath='../../module/nvpair/nvpair.c' line='2262' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_nvpair'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2262' column='1'/>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2262' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_merge' mangled-name='nvlist_merge' filepath='../../module/nvpair/nvpair.c' line='2279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_merge'>
      <parameter type-id='type-id-1' name='dst' filepath='../../module/nvpair/nvpair.c' line='2279' column='1'/>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2279' column='1'/>
      <parameter type-id='type-id-39' name='flag' filepath='../../module/nvpair/nvpair.c' line='2279' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_size' mangled-name='nvlist_size' filepath='../../module/nvpair/nvpair.c' line='2648' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_size'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2648' column='1'/>
      <parameter type-id='type-id-4' name='size' filepath='../../module/nvpair/nvpair.c' line='2648' column='1'/>
      <parameter type-id='type-id-39' name='encoding' filepath='../../module/nvpair/nvpair.c' line='2648' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_xpack' mangled-name='nvlist_xpack' filepath='../../module/nvpair/nvpair.c' line='2665' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xpack'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2665' column='1'/>
      <parameter type-id='type-id-112' name='bufp' filepath='../../module/nvpair/nvpair.c' line='2665' column='1'/>
      <parameter type-id='type-id-4' name='buflen' filepath='../../module/nvpair/nvpair.c' line='2665' column='1'/>
      <parameter type-id='type-id-39' name='encoding' filepath='../../module/nvpair/nvpair.c' line='2665' column='1'/>
      <parameter type-id='type-id-107' name='nva' filepath='../../module/nvpair/nvpair.c' line='2666' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_pack' mangled-name='nvlist_pack' filepath='../../module/nvpair/nvpair.c' line='2657' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_pack'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2657' column='1'/>
      <parameter type-id='type-id-112' name='bufp' filepath='../../module/nvpair/nvpair.c' line='2657' column='1'/>
      <parameter type-id='type-id-4' name='buflen' filepath='../../module/nvpair/nvpair.c' line='2657' column='1'/>
      <parameter type-id='type-id-39' name='encoding' filepath='../../module/nvpair/nvpair.c' line='2657' column='1'/>
      <parameter type-id='type-id-39' name='kmflag' filepath='../../module/nvpair/nvpair.c' line='2658' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_xunpack' mangled-name='nvlist_xunpack' filepath='../../module/nvpair/nvpair.c' line='2721' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xunpack'>
      <parameter type-id='type-id-5' name='buf' filepath='../../module/nvpair/nvpair.c' line='2721' column='1'/>
      <parameter type-id='type-id-3' name='buflen' filepath='../../module/nvpair/nvpair.c' line='2721' column='1'/>
      <parameter type-id='type-id-30' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='2721' column='1'/>
      <parameter type-id='type-id-107' name='nva' filepath='../../module/nvpair/nvpair.c' line='2721' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvlist_unpack' mangled-name='nvlist_unpack' filepath='../../module/nvpair/nvpair.c' line='2715' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_unpack'>
      <parameter type-id='type-id-5' name='buf' filepath='../../module/nvpair/nvpair.c' line='2715' column='1'/>
      <parameter type-id='type-id-3' name='buflen' filepath='../../module/nvpair/nvpair.c' line='2715' column='1'/>
      <parameter type-id='type-id-30' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='2715' column='1'/>
      <parameter type-id='type-id-39' name='kmflag' filepath='../../module/nvpair/nvpair.c' line='2715' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <var-decl name='nvpair_max_recursion' type-id='type-id-39' mangled-name='nvpair_max_recursion' visibility='default' filepath='../../module/nvpair/nvpair.c' line='151' column='1' elf-symbol-id='nvpair_max_recursion'/>
    <var-decl name='nvlist_hashtable_init_size' type-id='type-id-16' mangled-name='nvlist_hashtable_init_size' visibility='default' filepath='../../module/nvpair/nvpair.c' line='154' column='1' elf-symbol-id='nvlist_hashtable_init_size'/>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='395' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='bcopy' filepath='/usr/include/string.h' line='451' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='xdr_int' filepath='/usr/include/rpc/xdr.h' line='288' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='xdr_u_int' filepath='/usr/include/rpc/xdr.h' line='289' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-103'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='xdrmem_create' filepath='/usr/include/rpc/xdr.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='xdr_string' filepath='/usr/include/rpc/xdr.h' line='314' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='xdr_longlong_t' filepath='/usr/include/rpc/xdr.h' line='294' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-92'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='xdr_array' filepath='/usr/include/rpc/xdr.h' line='308' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-80'/>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-74'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='xdr_opaque' filepath='/usr/include/rpc/xdr.h' line='313' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='xdr_u_longlong_t' filepath='/usr/include/rpc/xdr.h' line='295' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-104'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='xdr_u_short' filepath='/usr/include/rpc/xdr.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-105'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='xdr_short' filepath='/usr/include/rpc/xdr.h' line='286' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-93'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='xdr_char' filepath='/usr/include/rpc/xdr.h' line='318' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='xdr_double' filepath='/usr/include/rpc/xdr.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-111'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='strncmp' filepath='/usr/include/string.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='strtol' filepath='/usr/include/stdlib.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-113'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-112'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-123'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-108'/>
    <type-decl name='double' size-in-bits='64' id='type-id-109'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-111'/>
    <function-type size-in-bits='64' id='type-id-89'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-25'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-94'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-95'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-96'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-97'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-98'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-90'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-99'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-100'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-101'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-126'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-102'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-56'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-106'>
      <parameter type-id='type-id-79'/>
      <return type-id='type-id-2'/>
    </function-type>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-125'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-117'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-119'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-121'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-115'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-107'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-124'/>
    <typedef-decl name='hrtime_t' type-id='type-id-129' filepath='../../lib/libspl/include/sys/time.h' line='78' column='1' id='type-id-110'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-114'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-120'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-122'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-116'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-126'/>
    <qualified-type-def type-id='type-id-130' const='yes' id='type-id-127'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-129'/>
    <typedef-decl name='nv_alloc_t' type-id='type-id-131' filepath='../../include/sys/nvpair.h' line='128' column='1' id='type-id-128'/>
    <class-decl name='nv_alloc' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='125' column='1' id='type-id-131'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nva_ops' type-id='type-id-108' visibility='default' filepath='../../include/sys/nvpair.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nva_arg' type-id='type-id-126' visibility='default' filepath='../../include/sys/nvpair.h' line='127' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nv_alloc_ops_t' type-id='type-id-132' filepath='../../include/sys/nvpair.h' line='123' column='1' id='type-id-130'/>
    <class-decl name='nv_alloc_ops' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='130' column='1' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nv_ao_init' type-id='type-id-133' visibility='default' filepath='../../include/sys/nvpair.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nv_ao_fini' type-id='type-id-134' visibility='default' filepath='../../include/sys/nvpair.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nv_ao_alloc' type-id='type-id-135' visibility='default' filepath='../../include/sys/nvpair.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nv_ao_free' type-id='type-id-136' visibility='default' filepath='../../include/sys/nvpair.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nv_ao_reset' type-id='type-id-134' visibility='default' filepath='../../include/sys/nvpair.h' line='135' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-133'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-134'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-136'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-135'/>
    <function-type size-in-bits='64' id='type-id-138'>
      <parameter type-id='type-id-107' name='nva'/>
      <return type-id='type-id-2'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/nvpair/nvpair_alloc_fixed.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair' language='LANG_C89'>
    <var-decl name='nv_fixed_ops' type-id='type-id-108' mangled-name='nv_fixed_ops' visibility='default' filepath='../../module/nvpair/nvpair_alloc_fixed.c' line='111' column='1' elf-symbol-id='nv_fixed_ops'/>
    <var-decl name='nv_fixed_ops_def' type-id='type-id-127' mangled-name='nv_fixed_ops_def' visibility='default' filepath='../../module/nvpair/nvpair_alloc_fixed.c' line='103' column='1' elf-symbol-id='nv_fixed_ops_def'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libnvpair.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair' language='LANG_C89'>
    <type-decl name='char' size-in-bits='8' id='type-id-32'/>
    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='8' id='type-id-141'>
      <subrange length='1' type-id='type-id-142' id='type-id-143'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='160' id='type-id-144'>
      <subrange length='20' type-id='type-id-142' id='type-id-145'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' id='type-id-109'/>
    <type-decl name='int' size-in-bits='32' id='type-id-39'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-40'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-129'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-38'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-41'/>
    <type-decl name='sizetype' size-in-bits='64' id='type-id-142'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-46'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-43'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-45'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-42'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-44'/>
    <type-decl name='variadic parameter type' id='type-id-146'/>
    <type-decl name='void' id='type-id-2'/>
    <typedef-decl name='nvlist_prtctl_t' type-id='type-id-147' filepath='../../include/libnvpair.h' line='84' column='1' id='type-id-148'/>
    <class-decl name='nvlist_prtctl' size-in-bits='576' is-struct='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='91' column='1' id='type-id-149'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvprt_fp' type-id='type-id-150' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvprt_indent_mode' type-id='type-id-151' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvprt_indent' type-id='type-id-39' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvprt_indentinc' type-id='type-id-39' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nvprt_nmfmt' type-id='type-id-6' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nvprt_eomfmt' type-id='type-id-6' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nvprt_btwnarrfmt' type-id='type-id-6' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nvprt_btwnarrfmt_nl' type-id='type-id-39' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nvprt_dfltops' type-id='type-id-152' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nvprt_custops' type-id='type-id-152' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='101' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-153' filepath='/usr/include/stdio.h' line='48' column='1' id='type-id-154'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/libio.h' line='246' column='1' id='type-id-153'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-39' visibility='default' filepath='/usr/include/libio.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-5' visibility='default' filepath='/usr/include/libio.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-5' visibility='default' filepath='/usr/include/libio.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-5' visibility='default' filepath='/usr/include/libio.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-5' visibility='default' filepath='/usr/include/libio.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-5' visibility='default' filepath='/usr/include/libio.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-5' visibility='default' filepath='/usr/include/libio.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-5' visibility='default' filepath='/usr/include/libio.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-5' visibility='default' filepath='/usr/include/libio.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-5' visibility='default' filepath='/usr/include/libio.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-5' visibility='default' filepath='/usr/include/libio.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-5' visibility='default' filepath='/usr/include/libio.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-155' visibility='default' filepath='/usr/include/libio.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-156' visibility='default' filepath='/usr/include/libio.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-39' visibility='default' filepath='/usr/include/libio.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-39' visibility='default' filepath='/usr/include/libio.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-157' visibility='default' filepath='/usr/include/libio.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-44' visibility='default' filepath='/usr/include/libio.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-41' visibility='default' filepath='/usr/include/libio.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-141' visibility='default' filepath='/usr/include/libio.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-158' visibility='default' filepath='/usr/include/libio.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-159' visibility='default' filepath='/usr/include/libio.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='__pad1' type-id='type-id-126' visibility='default' filepath='/usr/include/libio.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='__pad2' type-id='type-id-126' visibility='default' filepath='/usr/include/libio.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='__pad3' type-id='type-id-126' visibility='default' filepath='/usr/include/libio.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='__pad4' type-id='type-id-126' visibility='default' filepath='/usr/include/libio.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-3' visibility='default' filepath='/usr/include/libio.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-39' visibility='default' filepath='/usr/include/libio.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-144' visibility='default' filepath='/usr/include/libio.h' line='311' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/libio.h' line='161' column='1' id='type-id-160'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_next' type-id='type-id-155' visibility='default' filepath='/usr/include/libio.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_sbuf' type-id='type-id-156' visibility='default' filepath='/usr/include/libio.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_pos' type-id='type-id-39' visibility='default' filepath='/usr/include/libio.h' line='167' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__off_t' type-id='type-id-40' filepath='/usr/include/bits/types.h' line='140' column='1' id='type-id-157'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-2' filepath='/usr/include/libio.h' line='155' column='1' id='type-id-161'/>
    <typedef-decl name='__off64_t' type-id='type-id-40' filepath='/usr/include/bits/types.h' line='141' column='1' id='type-id-159'/>
    <typedef-decl name='size_t' type-id='type-id-42' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.8.5/include/stddef.h' line='212' column='1' id='type-id-3'/>
    <enum-decl name='nvlist_indent_mode' filepath='../../include/libnvpair.h' line='86' column='1' id='type-id-151'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='NVLIST_INDENT_ABS' value='0'/>
      <enumerator name='NVLIST_INDENT_TABBED' value='1'/>
    </enum-decl>
    <class-decl name='nvlist_printops' size-in-bits='3456' is-struct='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='61' column='1' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='print_boolean' type-id='type-id-163' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='print_boolean_value' type-id='type-id-164' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='print_byte' type-id='type-id-165' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='print_int8' type-id='type-id-166' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='print_uint8' type-id='type-id-167' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='print_int16' type-id='type-id-168' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='print_uint16' type-id='type-id-169' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='print_int32' type-id='type-id-170' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='print_uint32' type-id='type-id-171' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='print_int64' type-id='type-id-172' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='print_uint64' type-id='type-id-173' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='print_double' type-id='type-id-174' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='print_string' type-id='type-id-175' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='print_hrtime' type-id='type-id-176' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='print_nvlist' type-id='type-id-177' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='print_boolean_array' type-id='type-id-178' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='print_byte_array' type-id='type-id-179' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='print_int8_array' type-id='type-id-180' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='print_uint8_array' type-id='type-id-181' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='print_int16_array' type-id='type-id-182' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='print_uint16_array' type-id='type-id-183' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='print_int32_array' type-id='type-id-184' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='print_uint32_array' type-id='type-id-185' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='print_int64_array' type-id='type-id-186' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='print_uint64_array' type-id='type-id-187' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='print_string_array' type-id='type-id-188' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='print_nvlist_array' type-id='type-id-189' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='88' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='62' column='1' id='type-id-163'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-190' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='62' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nvlist_t' type-id='type-id-47' filepath='../../include/sys/nvpair.h' line='91' column='1' id='type-id-35'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='85' column='1' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-13' visibility='default' filepath='../../include/sys/nvpair.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-14' visibility='default' filepath='../../include/sys/nvpair.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-16' visibility='default' filepath='../../include/sys/nvpair.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-14' visibility='default' filepath='../../include/sys/nvpair.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-13' visibility='default' filepath='../../include/sys/nvpair.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int32_t' type-id='type-id-39' filepath='/usr/include/sys/types.h' line='196' column='1' id='type-id-13'/>
    <typedef-decl name='uint32_t' type-id='type-id-45' filepath='/usr/include/stdint.h' line='51' column='1' id='type-id-14'/>
    <typedef-decl name='uint64_t' type-id='type-id-42' filepath='/usr/include/stdint.h' line='55' column='1' id='type-id-16'/>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='63' column='1' id='type-id-164'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-191' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='63' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='boolean_t' type-id='type-id-37' filepath='../../lib/libspl/include/sys/stdtypes.h' line='29' column='1' id='type-id-7'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../lib/libspl/include/sys/stdtypes.h' line='26' column='1' id='type-id-37'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='64' column='1' id='type-id-165'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-192' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='64' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uchar_t' type-id='type-id-43' filepath='../../lib/libspl/include/sys/stdtypes.h' line='31' column='1' id='type-id-8'/>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='65' column='1' id='type-id-166'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-193' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='65' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int8_t' type-id='type-id-41' filepath='/usr/include/sys/types.h' line='194' column='1' id='type-id-9'/>
    <class-decl name='__anonymous_struct__4' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='66' column='1' id='type-id-167'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-194' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='66' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint8_t' type-id='type-id-43' filepath='/usr/include/stdint.h' line='48' column='1' id='type-id-10'/>
    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='67' column='1' id='type-id-168'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-195' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='67' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int16_t' type-id='type-id-38' filepath='/usr/include/sys/types.h' line='195' column='1' id='type-id-11'/>
    <class-decl name='__anonymous_struct__6' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='68' column='1' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-196' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='68' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint16_t' type-id='type-id-44' filepath='/usr/include/stdint.h' line='49' column='1' id='type-id-12'/>
    <class-decl name='__anonymous_struct__7' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='69' column='1' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-197' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='69' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='70' column='1' id='type-id-171'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-198' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='70' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='71' column='1' id='type-id-172'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-199' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='71' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int64_t' type-id='type-id-40' filepath='/usr/include/sys/types.h' line='197' column='1' id='type-id-15'/>
    <class-decl name='__anonymous_struct__10' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='72' column='1' id='type-id-173'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-200' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='72' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='73' column='1' id='type-id-174'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-201' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='73' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='74' column='1' id='type-id-175'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-202' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='74' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='75' column='1' id='type-id-176'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-203' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='75' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hrtime_t' type-id='type-id-129' filepath='../../lib/libspl/include/sys/time.h' line='78' column='1' id='type-id-110'/>
    <class-decl name='__anonymous_struct__14' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='76' column='1' id='type-id-177'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-204' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='76' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='77' column='1' id='type-id-178'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-205' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='77' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint_t' type-id='type-id-45' filepath='../../lib/libspl/include/sys/stdtypes.h' line='33' column='1' id='type-id-19'/>
    <class-decl name='__anonymous_struct__16' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='78' column='1' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-206' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='78' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='79' column='1' id='type-id-180'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-207' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='79' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__18' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='80' column='1' id='type-id-181'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-208' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='80' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='81' column='1' id='type-id-182'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-209' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='81' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='82' column='1' id='type-id-183'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-210' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='82' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='83' column='1' id='type-id-184'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-211' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='83' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__22' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='84' column='1' id='type-id-185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-212' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='84' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__23' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='85' column='1' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-213' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='85' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__24' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='86' column='1' id='type-id-187'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-214' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='86' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__25' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='87' column='1' id='type-id-188'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-215' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='87' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__26' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='88' column='1' id='type-id-189'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-216' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-126' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='88' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='nvlist_prtctl_fmt' filepath='../../include/libnvpair.h' line='104' column='1' id='type-id-217'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='NVLIST_FMT_MEMBER_NAME' value='0'/>
      <enumerator name='NVLIST_FMT_MEMBER_POSTAMBLE' value='1'/>
      <enumerator name='NVLIST_FMT_BTWN_ARRAY' value='2'/>
    </enum-decl>
    <typedef-decl name='nvpair_t' type-id='type-id-48' filepath='../../include/sys/nvpair.h' line='82' column='1' id='type-id-36'/>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='73' column='1' id='type-id-48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='type-id-13' visibility='default' filepath='../../include/sys/nvpair.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='type-id-11' visibility='default' filepath='../../include/sys/nvpair.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='type-id-11' visibility='default' filepath='../../include/sys/nvpair.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='type-id-13' visibility='default' filepath='../../include/sys/nvpair.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='type-id-49' visibility='default' filepath='../../include/sys/nvpair.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='data_type_t' type-id='type-id-50' filepath='../../include/sys/nvpair.h' line='71' column='1' id='type-id-49'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' filepath='../../include/sys/nvpair.h' line='37' column='1' id='type-id-50'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
    <typedef-decl name='regex_t' type-id='type-id-218' filepath='/usr/include/regex.h' line='424' column='1' id='type-id-219'/>
    <class-decl name='re_pattern_buffer' size-in-bits='512' is-struct='yes' visibility='default' filepath='/usr/include/regex.h' line='358' column='1' id='type-id-218'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-220' visibility='default' filepath='/usr/include/regex.h' line='363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-42' visibility='default' filepath='/usr/include/regex.h' line='366' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used' type-id='type-id-42' visibility='default' filepath='/usr/include/regex.h' line='369' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='syntax' type-id='type-id-221' visibility='default' filepath='/usr/include/regex.h' line='372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fastmap' type-id='type-id-5' visibility='default' filepath='/usr/include/regex.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='translate' type-id='type-id-220' visibility='default' filepath='/usr/include/regex.h' line='383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='re_nsub' type-id='type-id-3' visibility='default' filepath='/usr/include/regex.h' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='can_be_null' type-id='type-id-45' visibility='default' filepath='/usr/include/regex.h' line='392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='regs_allocated' type-id='type-id-45' visibility='default' filepath='/usr/include/regex.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='fastmap_accurate' type-id='type-id-45' visibility='default' filepath='/usr/include/regex.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='no_sub' type-id='type-id-45' visibility='default' filepath='/usr/include/regex.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='not_bol' type-id='type-id-45' visibility='default' filepath='/usr/include/regex.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='not_eol' type-id='type-id-45' visibility='default' filepath='/usr/include/regex.h' line='418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='newline_anchor' type-id='type-id-45' visibility='default' filepath='/usr/include/regex.h' line='421' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='reg_syntax_t' type-id='type-id-42' filepath='/usr/include/regex.h' line='43' column='1' id='type-id-221'/>
    <typedef-decl name='regmatch_t' type-id='type-id-222' filepath='/usr/include/regex.h' line='457' column='1' id='type-id-223'/>
    <class-decl name='__anonymous_struct__27' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-223' visibility='default' filepath='/usr/include/regex.h' line='453' column='1' id='type-id-222'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rm_so' type-id='type-id-224' visibility='default' filepath='/usr/include/regex.h' line='455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rm_eo' type-id='type-id-224' visibility='default' filepath='/usr/include/regex.h' line='456' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='regoff_t' type-id='type-id-39' filepath='/usr/include/regex.h' line='427' column='1' id='type-id-224'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-150'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-156'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-158'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-155'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-113'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-5'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-112'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-123'/>
    <qualified-type-def type-id='type-id-32' const='yes' id='type-id-34'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-6'/>
    <qualified-type-def type-id='type-id-219' const='yes' id='type-id-225'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-226'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-111'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-125'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' id='type-id-205'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-202'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-215'/>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' id='type-id-201'/>
    <pointer-type-def type-id='type-id-231' size-in-bits='64' id='type-id-190'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' id='type-id-209'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' id='type-id-211'/>
    <pointer-type-def type-id='type-id-234' size-in-bits='64' id='type-id-213'/>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-207'/>
    <pointer-type-def type-id='type-id-236' size-in-bits='64' id='type-id-204'/>
    <pointer-type-def type-id='type-id-237' size-in-bits='64' id='type-id-216'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-191'/>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-203'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-195'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-197'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-199'/>
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-193'/>
    <pointer-type-def type-id='type-id-244' size-in-bits='64' id='type-id-192'/>
    <pointer-type-def type-id='type-id-245' size-in-bits='64' id='type-id-196'/>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' id='type-id-198'/>
    <pointer-type-def type-id='type-id-247' size-in-bits='64' id='type-id-200'/>
    <pointer-type-def type-id='type-id-248' size-in-bits='64' id='type-id-194'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-206'/>
    <pointer-type-def type-id='type-id-250' size-in-bits='64' id='type-id-210'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-212'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-214'/>
    <pointer-type-def type-id='type-id-253' size-in-bits='64' id='type-id-208'/>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' id='type-id-255'/>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-257'/>
    <pointer-type-def type-id='type-id-258' size-in-bits='64' id='type-id-259'/>
    <pointer-type-def type-id='type-id-260' size-in-bits='64' id='type-id-261'/>
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-263'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-265'/>
    <pointer-type-def type-id='type-id-266' size-in-bits='64' id='type-id-267'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-269'/>
    <pointer-type-def type-id='type-id-270' size-in-bits='64' id='type-id-271'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-273'/>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-275'/>
    <pointer-type-def type-id='type-id-276' size-in-bits='64' id='type-id-277'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-279'/>
    <pointer-type-def type-id='type-id-280' size-in-bits='64' id='type-id-281'/>
    <pointer-type-def type-id='type-id-282' size-in-bits='64' id='type-id-283'/>
    <pointer-type-def type-id='type-id-284' size-in-bits='64' id='type-id-285'/>
    <pointer-type-def type-id='type-id-286' size-in-bits='64' id='type-id-287'/>
    <pointer-type-def type-id='type-id-288' size-in-bits='64' id='type-id-289'/>
    <pointer-type-def type-id='type-id-290' size-in-bits='64' id='type-id-291'/>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' id='type-id-293'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-295'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' id='type-id-297'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-299'/>
    <pointer-type-def type-id='type-id-300' size-in-bits='64' id='type-id-301'/>
    <pointer-type-def type-id='type-id-302' size-in-bits='64' id='type-id-303'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' id='type-id-305'/>
    <pointer-type-def type-id='type-id-306' size-in-bits='64' id='type-id-307'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-117'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-25'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-119'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-121'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-21'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-115'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-152'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-147'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-1'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-30'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-124'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-308'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-309'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-20'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-114'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-26'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-120'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-28'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-122'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-22'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-116'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-220'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-126'/>
    <function-decl name='nvlist_prtctl_setdest' mangled-name='nvlist_prtctl_setdest' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setdest'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='312' column='1'/>
      <parameter type-id='type-id-150' name='fp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='312' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_getdest' mangled-name='nvlist_prtctl_getdest' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_getdest'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='318' column='1'/>
      <return type-id='type-id-150'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_setindent' mangled-name='nvlist_prtctl_setindent' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='325' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setindent'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='325' column='1'/>
      <parameter type-id='type-id-151' name='mode' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='325' column='1'/>
      <parameter type-id='type-id-39' name='start' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='326' column='1'/>
      <parameter type-id='type-id-39' name='inc' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='326' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_doindent' mangled-name='nvlist_prtctl_doindent' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_doindent'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='343' column='1'/>
      <parameter type-id='type-id-39' name='onemore' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='343' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_setfmt' mangled-name='nvlist_prtctl_setfmt' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setfmt'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='350' column='1'/>
      <parameter type-id='type-id-217' name='which' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='350' column='1'/>
      <parameter type-id='type-id-6' name='fmt' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='351' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_dofmt' mangled-name='nvlist_prtctl_dofmt' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_dofmt'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='383' column='1'/>
      <parameter type-id='type-id-217' name='which' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='383' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_boolean' mangled-name='nvlist_prtctlop_boolean' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='430' column='1'/>
      <parameter type-id='type-id-263' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='430' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='430' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_boolean_value' mangled-name='nvlist_prtctlop_boolean_value' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='431' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean_value'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='431' column='1'/>
      <parameter type-id='type-id-277' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='431' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='431' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_byte' mangled-name='nvlist_prtctlop_byte' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_byte'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='432' column='1'/>
      <parameter type-id='type-id-289' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='432' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='432' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int8' mangled-name='nvlist_prtctlop_int8' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int8'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='433' column='1'/>
      <parameter type-id='type-id-287' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='433' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='433' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint8' mangled-name='nvlist_prtctlop_uint8' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint8'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='434' column='1'/>
      <parameter type-id='type-id-297' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='434' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='434' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int16' mangled-name='nvlist_prtctlop_int16' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int16'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='435' column='1'/>
      <parameter type-id='type-id-281' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='435' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='435' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint16' mangled-name='nvlist_prtctlop_uint16' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='436' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint16'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='436' column='1'/>
      <parameter type-id='type-id-291' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='436' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='436' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int32' mangled-name='nvlist_prtctlop_int32' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='437' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int32'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='437' column='1'/>
      <parameter type-id='type-id-283' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='437' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='437' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint32' mangled-name='nvlist_prtctlop_uint32' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='438' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint32'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='438' column='1'/>
      <parameter type-id='type-id-293' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='438' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='438' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int64' mangled-name='nvlist_prtctlop_int64' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='439' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int64'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='439' column='1'/>
      <parameter type-id='type-id-285' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='439' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='439' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint64' mangled-name='nvlist_prtctlop_uint64' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='440' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint64'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='440' column='1'/>
      <parameter type-id='type-id-295' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='440' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='440' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_double' mangled-name='nvlist_prtctlop_double' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='441' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_double'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='441' column='1'/>
      <parameter type-id='type-id-261' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='441' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='441' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_string' mangled-name='nvlist_prtctlop_string' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='442' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_string'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='442' column='1'/>
      <parameter type-id='type-id-257' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='442' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='442' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_hrtime' mangled-name='nvlist_prtctlop_hrtime' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='443' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_hrtime'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='443' column='1'/>
      <parameter type-id='type-id-279' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='443' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='443' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_nvlist' mangled-name='nvlist_prtctlop_nvlist' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='444' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_nvlist'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='444' column='1'/>
      <parameter type-id='type-id-273' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='444' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='444' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_boolean_array' mangled-name='nvlist_prtctlop_boolean_array' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='456' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean_array'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='456' column='1'/>
      <parameter type-id='type-id-255' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='456' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='456' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_byte_array' mangled-name='nvlist_prtctlop_byte_array' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_byte_array'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='457' column='1'/>
      <parameter type-id='type-id-299' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='457' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='457' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int8_array' mangled-name='nvlist_prtctlop_int8_array' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='458' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int8_array'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='458' column='1'/>
      <parameter type-id='type-id-271' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='458' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='458' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint8_array' mangled-name='nvlist_prtctlop_uint8_array' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint8_array'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='459' column='1'/>
      <parameter type-id='type-id-307' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='459' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='459' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int16_array' mangled-name='nvlist_prtctlop_int16_array' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='460' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int16_array'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='460' column='1'/>
      <parameter type-id='type-id-265' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='460' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='460' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint16_array' mangled-name='nvlist_prtctlop_uint16_array' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint16_array'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='461' column='1'/>
      <parameter type-id='type-id-301' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='461' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='461' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int32_array' mangled-name='nvlist_prtctlop_int32_array' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='462' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int32_array'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='462' column='1'/>
      <parameter type-id='type-id-267' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='462' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='462' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint32_array' mangled-name='nvlist_prtctlop_uint32_array' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='463' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint32_array'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='463' column='1'/>
      <parameter type-id='type-id-303' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='463' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='463' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int64_array' mangled-name='nvlist_prtctlop_int64_array' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='464' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int64_array'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='464' column='1'/>
      <parameter type-id='type-id-269' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='464' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='464' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint64_array' mangled-name='nvlist_prtctlop_uint64_array' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='465' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint64_array'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='465' column='1'/>
      <parameter type-id='type-id-305' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='465' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='465' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_string_array' mangled-name='nvlist_prtctlop_string_array' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_string_array'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='466' column='1'/>
      <parameter type-id='type-id-259' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='466' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='466' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_nvlist_array' mangled-name='nvlist_prtctlop_nvlist_array' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_nvlist_array'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='467' column='1'/>
      <parameter type-id='type-id-275' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='467' column='1'/>
      <parameter type-id='type-id-126' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='467' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_alloc' mangled-name='nvlist_prtctl_alloc' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='527' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_alloc'>
      <return type-id='type-id-148'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_free' mangled-name='nvlist_prtctl_free' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='546' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_free'>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='546' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_print' mangled-name='nvlist_print' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='757' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_print'>
      <parameter type-id='type-id-150' name='fp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='757' column='1'/>
      <parameter type-id='type-id-1' name='nvl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='757' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prt' mangled-name='nvlist_prt' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='766' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prt'>
      <parameter type-id='type-id-1' name='nvl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='766' column='1'/>
      <parameter type-id='type-id-148' name='pctl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='766' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='dump_nvlist' mangled-name='dump_nvlist' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='794' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dump_nvlist'>
      <parameter type-id='type-id-1' name='list' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='794' column='1'/>
      <parameter type-id='type-id-39' name='indent' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='794' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvpair_value_match_regex' mangled-name='nvpair_value_match_regex' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='949' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_match_regex'>
      <parameter type-id='type-id-17' name='nvp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='949' column='1'/>
      <parameter type-id='type-id-39' name='ai' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='949' column='1'/>
      <parameter type-id='type-id-5' name='value' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='950' column='1'/>
      <parameter type-id='type-id-308' name='value_regex' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='950' column='1'/>
      <parameter type-id='type-id-112' name='ep' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='950' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_match' mangled-name='nvpair_value_match' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='1274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_match'>
      <parameter type-id='type-id-17' name='nvp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='1274' column='1'/>
      <parameter type-id='type-id-39' name='ai' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='1274' column='1'/>
      <parameter type-id='type-id-5' name='value' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='1274' column='1'/>
      <parameter type-id='type-id-112' name='ep' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair.c' line='1274' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='fprintf' filepath='/usr/include/stdio.h' line='356' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist_array' mangled-name='nvpair_value_nvlist_array' filepath='../../include/sys/nvpair.h' line='270' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_nvlist_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-124'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_double' mangled-name='nvpair_value_double' filepath='../../include/sys/nvpair.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_double'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-111'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8_array' mangled-name='nvpair_value_uint8_array' filepath='../../include/sys/nvpair.h' line='262' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint8_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-116'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_int8_array' mangled-name='nvpair_value_int8_array' filepath='../../include/sys/nvpair.h' line='261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int8_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-115'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_boolean_array' mangled-name='nvpair_value_boolean_array' filepath='../../include/sys/nvpair.h' line='259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_boolean_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-113'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8' mangled-name='nvpair_value_uint8' filepath='../../include/sys/nvpair.h' line='250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint8'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_int8' mangled-name='nvpair_value_int8' filepath='../../include/sys/nvpair.h' line='249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int8'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_boolean_value' mangled-name='nvpair_value_boolean_value' filepath='../../include/sys/nvpair.h' line='247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_boolean_value'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' mangled-name='nvpair_value_nvlist' filepath='../../include/sys/nvpair.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_nvlist'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_hrtime' mangled-name='nvpair_value_hrtime' filepath='../../include/sys/nvpair.h' line='271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_hrtime'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-125'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_string_array' mangled-name='nvpair_value_string_array' filepath='../../include/sys/nvpair.h' line='269' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_string_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64_array' mangled-name='nvpair_value_uint64_array' filepath='../../include/sys/nvpair.h' line='268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint64_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-122'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_int64_array' mangled-name='nvpair_value_int64_array' filepath='../../include/sys/nvpair.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int64_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-121'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_uint32_array' mangled-name='nvpair_value_uint32_array' filepath='../../include/sys/nvpair.h' line='266' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint32_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-120'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_int32_array' mangled-name='nvpair_value_int32_array' filepath='../../include/sys/nvpair.h' line='265' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int32_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_uint16_array' mangled-name='nvpair_value_uint16_array' filepath='../../include/sys/nvpair.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint16_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-118'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_int16_array' mangled-name='nvpair_value_int16_array' filepath='../../include/sys/nvpair.h' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int16_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_byte_array' mangled-name='nvpair_value_byte_array' filepath='../../include/sys/nvpair.h' line='260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_byte_array'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-114'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_string' mangled-name='nvpair_value_string' filepath='../../include/sys/nvpair.h' line='257' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_string'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64' mangled-name='nvpair_value_uint64' filepath='../../include/sys/nvpair.h' line='256' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_int64' mangled-name='nvpair_value_int64' filepath='../../include/sys/nvpair.h' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_uint32' mangled-name='nvpair_value_uint32' filepath='../../include/sys/nvpair.h' line='254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint32'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_int32' mangled-name='nvpair_value_int32' filepath='../../include/sys/nvpair.h' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int32'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_uint16' mangled-name='nvpair_value_uint16' filepath='../../include/sys/nvpair.h' line='252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint16'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_int16' mangled-name='nvpair_value_int16' filepath='../../include/sys/nvpair.h' line='251' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int16'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_value_byte' mangled-name='nvpair_value_byte' filepath='../../include/sys/nvpair.h' line='248' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_byte'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_type' mangled-name='nvpair_type' filepath='../../include/sys/nvpair.h' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_type'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='nvpair_name' mangled-name='nvpair_name' filepath='../../include/sys/nvpair.h' line='244' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_name'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvlist_next_nvpair' mangled-name='nvlist_next_nvpair' filepath='../../include/sys/nvpair.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_next_nvpair'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='465' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-126'/>
    </function-decl>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='467' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-126'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='482' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-126'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='printf' filepath='/usr/include/stdio.h' line='362' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='dcgettext' filepath='/usr/include/libintl.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='sscanf' filepath='/usr/include/stdio.h' line='433' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='regexec' filepath='/usr/include/regex.h' line='567' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-226'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-309'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='nvpair_type_is_array' mangled-name='nvpair_type_is_array' filepath='../../include/sys/nvpair.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_type_is_array'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-227'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-228'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-229'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-230'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-109'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-231'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-232'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-233'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-234'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-235'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-236'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-237'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-238'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-239'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-110'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-240'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-241'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-242'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-243'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-244'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-245'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-246'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-247'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-248'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-249'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-250'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-251'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-252'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-253'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-254'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-256'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-258'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-260'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-109'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-262'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-264'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-266'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-268'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-270'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-272'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-274'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-276'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-278'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-110'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-280'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-282'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-284'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-286'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-288'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-290'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-292'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-294'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-296'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-298'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-300'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-302'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-304'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-306'>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-39'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libnvpair_json.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='32' id='type-id-310'>
      <subrange length='4' type-id='type-id-142' id='type-id-311'/>
    </array-type-def>
    <typedef-decl name='wchar_t' type-id='type-id-39' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.8.5/include/stddef.h' line='324' column='1' id='type-id-312'/>
    <typedef-decl name='mbstate_t' type-id='type-id-313' filepath='/usr/include/wchar.h' line='106' column='1' id='type-id-314'/>
    <typedef-decl name='__mbstate_t' type-id='type-id-315' filepath='/usr/include/wchar.h' line='94' column='1' id='type-id-313'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-313' visibility='default' filepath='/usr/include/wchar.h' line='82' column='1' id='type-id-315'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-39' visibility='default' filepath='/usr/include/wchar.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-316' visibility='default' filepath='/usr/include/wchar.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/wchar.h' line='85' column='1' id='type-id-316'>
      <data-member access='private'>
        <var-decl name='__wch' type-id='type-id-45' visibility='default' filepath='/usr/include/wchar.h' line='88' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__wchb' type-id='type-id-310' visibility='default' filepath='/usr/include/wchar.h' line='92' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-314' size-in-bits='64' id='type-id-317'/>
    <pointer-type-def type-id='type-id-312' size-in-bits='64' id='type-id-318'/>
    <function-decl name='nvlist_print_json' mangled-name='nvlist_print_json' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair_json.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_print_json'>
      <parameter type-id='type-id-150' name='fp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair_json.c' line='118' column='1'/>
      <parameter type-id='type-id-1' name='nvl' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/libnvpair_json.c' line='118' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__ctype_get_mb_cur_max' filepath='/usr/include/stdlib.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='mbrtowc' filepath='/usr/include/wchar.h' line='365' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-318'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-317'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' filepath='../../lib/libspl/include/assert.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libspl_assertf'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvpair_value_string' mangled-name='fnvpair_value_string' filepath='../../include/sys/nvpair.h' line='351' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_string'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvpair_value_byte' mangled-name='fnvpair_value_byte' filepath='../../include/sys/nvpair.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_byte'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvpair_value_int16' mangled-name='fnvpair_value_int16' filepath='../../include/sys/nvpair.h' line='344' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int16'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint16' mangled-name='fnvpair_value_uint16' filepath='../../include/sys/nvpair.h' line='348' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint16'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='fnvpair_value_int32' mangled-name='fnvpair_value_int32' filepath='../../include/sys/nvpair.h' line='345' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int32'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint32' mangled-name='fnvpair_value_uint32' filepath='../../include/sys/nvpair.h' line='349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint32'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='fnvpair_value_int64' mangled-name='fnvpair_value_int64' filepath='../../include/sys/nvpair.h' line='346' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int64'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint64' mangled-name='fnvpair_value_uint64' filepath='../../include/sys/nvpair.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint64'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fnvpair_value_nvlist' mangled-name='fnvpair_value_nvlist' filepath='../../include/sys/nvpair.h' line='352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_nvlist'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvpair_value_boolean_value' mangled-name='fnvpair_value_boolean_value' filepath='../../include/sys/nvpair.h' line='341' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_boolean_value'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvpair_value_int8' mangled-name='fnvpair_value_int8' filepath='../../include/sys/nvpair.h' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int8'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint8' mangled-name='fnvpair_value_uint8' filepath='../../include/sys/nvpair.h' line='347' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint8'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='nvpair_alloc_system.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair' language='LANG_C89'>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-319'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-126' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-126' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nv_alloc' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='125' column='1' id='type-id-131'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nva_ops' type-id='type-id-108' visibility='default' filepath='../../include/sys/nvpair.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nva_arg' type-id='type-id-126' visibility='default' filepath='../../include/sys/nvpair.h' line='127' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nv_alloc_ops_t' type-id='type-id-132' filepath='../../include/sys/nvpair.h' line='123' column='1' id='type-id-130'/>
    <class-decl name='nv_alloc_ops' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='130' column='1' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nv_ao_init' type-id='type-id-133' visibility='default' filepath='../../include/sys/nvpair.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nv_ao_fini' type-id='type-id-134' visibility='default' filepath='../../include/sys/nvpair.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nv_ao_alloc' type-id='type-id-135' visibility='default' filepath='../../include/sys/nvpair.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nv_ao_free' type-id='type-id-136' visibility='default' filepath='../../include/sys/nvpair.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nv_ao_reset' type-id='type-id-134' visibility='default' filepath='../../include/sys/nvpair.h' line='135' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nv_alloc_t' type-id='type-id-131' filepath='../../include/sys/nvpair.h' line='128' column='1' id='type-id-128'/>
    <pointer-type-def type-id='type-id-319' size-in-bits='64' id='type-id-320'/>
    <qualified-type-def type-id='type-id-130' const='yes' id='type-id-127'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-108'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-133'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-107'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-134'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-136'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-135'/>
    <var-decl name='nv_alloc_nosleep' type-id='type-id-107' mangled-name='nv_alloc_nosleep' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/nvpair_alloc_system.c' line='65' column='1' elf-symbol-id='nv_alloc_nosleep'/>
    <var-decl name='nv_alloc_sleep_def' type-id='type-id-128' mangled-name='nv_alloc_sleep_def' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/nvpair_alloc_system.c' line='54' column='1' elf-symbol-id='nv_alloc_sleep_def'/>
    <var-decl name='nv_alloc_nosleep_def' type-id='type-id-128' mangled-name='nv_alloc_nosleep_def' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/nvpair_alloc_system.c' line='59' column='1' elf-symbol-id='nv_alloc_nosleep_def'/>
    <var-decl name='nv_alloc_sleep' type-id='type-id-107' mangled-name='nv_alloc_sleep' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libnvpair/nvpair_alloc_system.c' line='64' column='1' elf-symbol-id='nv_alloc_sleep'/>
    <function-type size-in-bits='64' id='type-id-137'>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-320'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-139'>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-140'>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-126'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='assert.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl' language='LANG_C89'>
    <var-decl name='aok' type-id='type-id-39' mangled-name='aok' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/assert.c' line='28' column='1' elf-symbol-id='aok'/>
    <function-decl name='vfprintf' filepath='/usr/include/stdio.h' line='371' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-320'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='abort' filepath='/usr/include/stdlib.h' line='514' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
