<abi-corpus path='libuutil.so' architecture='elf-amd-x86_64' soname='libuutil.so.3'>
  <elf-needed>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_sol_getmntent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32' type='func-type' binding='global-binding' visibility='default-visibility' alias='atomic_add_int' is-defined='yes'/>
    <elf-symbol name='atomic_add_32_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_64' type='func-type' binding='global-binding' visibility='default-visibility' alias='atomic_add_ptr,atomic_add_long' is-defined='yes'/>
    <elf-symbol name='atomic_add_64_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='uu_msprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_open_tmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_panic' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_set_error' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_setpname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strbw' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strcaseeq' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_streq' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strndup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_vdie' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_vwarn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_vxdie' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_warn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_xdie' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_zalloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='aok' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='buf' size='4110' type='tls-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='pagesize' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_exit_fatal_value' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_exit_ok_value' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_exit_usage_value' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='../../module/avl/avl.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libavl' language='LANG_C89'>
    <function-decl name='avl_insert_here' mangled-name='avl_insert_here' filepath='../../module/avl/avl.c' line='575' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert_here'>
      <parameter type-id='type-id-1' name='tree' filepath='../../module/avl/avl.c' line='576' column='1'/>
      <parameter type-id='type-id-2' name='new_data' filepath='../../module/avl/avl.c' line='577' column='1'/>
      <parameter type-id='type-id-2' name='here' filepath='../../module/avl/avl.c' line='578' column='1'/>
      <parameter type-id='type-id-3' name='direction' filepath='../../module/avl/avl.c' line='579' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_add' mangled-name='avl_add' filepath='../../module/avl/avl.c' line='636' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_add'>
      <parameter type-id='type-id-1' name='tree' filepath='../../module/avl/avl.c' line='636' column='1'/>
      <parameter type-id='type-id-2' name='new_node' filepath='../../module/avl/avl.c' line='636' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_update_lt' mangled-name='avl_update_lt' filepath='../../module/avl/avl.c' line='817' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_lt'>
      <parameter type-id='type-id-1' name='t' filepath='../../module/avl/avl.c' line='817' column='1'/>
      <parameter type-id='type-id-2' name='obj' filepath='../../module/avl/avl.c' line='817' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_update_gt' mangled-name='avl_update_gt' filepath='../../module/avl/avl.c' line='834' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_gt'>
      <parameter type-id='type-id-1' name='t' filepath='../../module/avl/avl.c' line='834' column='1'/>
      <parameter type-id='type-id-2' name='obj' filepath='../../module/avl/avl.c' line='834' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_update' mangled-name='avl_update' filepath='../../module/avl/avl.c' line='851' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update'>
      <parameter type-id='type-id-1' name='t' filepath='../../module/avl/avl.c' line='851' column='1'/>
      <parameter type-id='type-id-2' name='obj' filepath='../../module/avl/avl.c' line='851' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_swap' mangled-name='avl_swap' filepath='../../module/avl/avl.c' line='871' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_swap'>
      <parameter type-id='type-id-1' name='tree1' filepath='../../module/avl/avl.c' line='871' column='1'/>
      <parameter type-id='type-id-1' name='tree2' filepath='../../module/avl/avl.c' line='871' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_is_empty' mangled-name='avl_is_empty' filepath='../../module/avl/avl.c' line='934' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_is_empty'>
      <parameter type-id='type-id-1' name='tree' filepath='../../module/avl/avl.c' line='934' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' filepath='../../lib/libspl/include/assert.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libspl_assertf'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-1'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-6'/>
    <type-decl name='int' size-in-bits='32' id='type-id-3'/>
    <typedef-decl name='boolean_t' type-id='type-id-9' filepath='../../lib/libspl/include/sys/stdtypes.h' line='29' column='1' id='type-id-5'/>
    <type-decl name='void' id='type-id-4'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-2'/>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-8'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../lib/libspl/include/sys/stdtypes.h' line='26' column='1' id='type-id-9'>
      <underlying-type type-id='type-id-11'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='avl_tree_t' type-id='type-id-12' filepath='../../include/sys/avl.h' line='119' column='1' id='type-id-7'/>
    <type-decl name='char' size-in-bits='8' id='type-id-10'/>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='146' column='1' id='type-id-12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-13' visibility='default' filepath='../../include/sys/avl_impl.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-14' visibility='default' filepath='../../include/sys/avl_impl.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-15' visibility='default' filepath='../../include/sys/avl_impl.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-16' visibility='default' filepath='../../include/sys/avl_impl.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_size' type-id='type-id-15' visibility='default' filepath='../../include/sys/avl_impl.h' line='151' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-13'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-14'/>
    <typedef-decl name='size_t' type-id='type-id-19' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.8.5/include/stddef.h' line='212' column='1' id='type-id-15'/>
    <typedef-decl name='ulong_t' type-id='type-id-19' filepath='../../lib/libspl/include/sys/stdtypes.h' line='34' column='1' id='type-id-16'/>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='90' column='1' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-20' visibility='default' filepath='../../include/sys/avl_impl.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-21' visibility='default' filepath='../../include/sys/avl_impl.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-19'/>
    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='128' id='type-id-20'>
      <subrange length='2' type-id='type-id-22' id='type-id-23'/>
    </array-type-def>
    <typedef-decl name='uintptr_t' type-id='type-id-19' filepath='/usr/include/stdint.h' line='122' column='1' id='type-id-21'/>
    <type-decl name='sizetype' size-in-bits='64' id='type-id-22'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='assert.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl' language='LANG_C89'>
    <var-decl name='aok' type-id='type-id-3' mangled-name='aok' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/assert.c' line='28' column='1' elf-symbol-id='aok'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='list.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl' language='LANG_C89'>
    <typedef-decl name='list_t' type-id='type-id-24' filepath='../../lib/libspl/include/sys/list.h' line='36' column='1' id='type-id-25'/>
    <class-decl name='list' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='41' column='1' id='type-id-24'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='list_size' type-id='type-id-15' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='list_offset' type-id='type-id-15' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='list_head' type-id='type-id-26' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='44' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='list_node' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='36' column='1' id='type-id-26'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-27' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prev' type-id='type-id-27' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='list_node_t' type-id='type-id-26' filepath='../../lib/libspl/include/sys/list.h' line='35' column='1' id='type-id-28'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-29'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-30'/>
    <function-decl name='list_create' mangled-name='list_create' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_create'>
      <parameter type-id='type-id-30' name='list' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='62' column='1'/>
      <parameter type-id='type-id-15' name='size' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='62' column='1'/>
      <parameter type-id='type-id-15' name='offset' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='62' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_destroy' mangled-name='list_destroy' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_destroy'>
      <parameter type-id='type-id-30' name='list' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='74' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_insert_head' mangled-name='list_insert_head' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_head'>
      <parameter type-id='type-id-30' name='list' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='108' column='1'/>
      <parameter type-id='type-id-2' name='object' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='108' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_insert_after' mangled-name='list_insert_after' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_after'>
      <parameter type-id='type-id-30' name='list' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='86' column='1'/>
      <parameter type-id='type-id-2' name='object' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='86' column='1'/>
      <parameter type-id='type-id-2' name='nobject' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='86' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_insert_tail' mangled-name='list_insert_tail' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_tail'>
      <parameter type-id='type-id-30' name='list' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='115' column='1'/>
      <parameter type-id='type-id-2' name='object' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='115' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_insert_before' mangled-name='list_insert_before' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_before'>
      <parameter type-id='type-id-30' name='list' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='97' column='1'/>
      <parameter type-id='type-id-2' name='object' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='97' column='1'/>
      <parameter type-id='type-id-2' name='nobject' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='97' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_remove' mangled-name='list_remove' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove'>
      <parameter type-id='type-id-30' name='list' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='122' column='1'/>
      <parameter type-id='type-id-2' name='object' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='122' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_remove_head' mangled-name='list_remove_head' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_head'>
      <parameter type-id='type-id-30' name='list' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='131' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='list_remove_tail' mangled-name='list_remove_tail' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_tail'>
      <parameter type-id='type-id-30' name='list' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='141' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='list_head' mangled-name='list_head' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_head'>
      <parameter type-id='type-id-30' name='list' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='151' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='list_tail' mangled-name='list_tail' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_tail'>
      <parameter type-id='type-id-30' name='list' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='159' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='list_next' mangled-name='list_next' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_next'>
      <parameter type-id='type-id-30' name='list' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='167' column='1'/>
      <parameter type-id='type-id-2' name='object' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='167' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='list_prev' mangled-name='list_prev' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_prev'>
      <parameter type-id='type-id-30' name='list' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='178' column='1'/>
      <parameter type-id='type-id-2' name='object' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='178' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='list_move_tail' mangled-name='list_move_tail' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_move_tail'>
      <parameter type-id='type-id-30' name='dst' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='192' column='1'/>
      <parameter type-id='type-id-30' name='src' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='192' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_link_replace' mangled-name='list_link_replace' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_replace'>
      <parameter type-id='type-id-29' name='lold' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='213' column='1'/>
      <parameter type-id='type-id-29' name='lnew' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='213' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_link_init' mangled-name='list_link_init' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_init'>
      <parameter type-id='type-id-29' name='ln' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='226' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='list_link_active' mangled-name='list_link_active' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_active'>
      <parameter type-id='type-id-29' name='ln' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='233' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='list_is_empty' mangled-name='list_is_empty' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_is_empty'>
      <parameter type-id='type-id-30' name='list' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/list.c' line='240' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='mkdirp.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl' language='LANG_C89'>
    <typedef-decl name='mode_t' type-id='type-id-31' filepath='/usr/include/sys/types.h' line='70' column='1' id='type-id-32'/>
    <typedef-decl name='__mode_t' type-id='type-id-33' filepath='/usr/include/bits/types.h' line='138' column='1' id='type-id-31'/>
    <typedef-decl name='wchar_t' type-id='type-id-3' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.8.5/include/stddef.h' line='324' column='1' id='type-id-34'/>
    <qualified-type-def type-id='type-id-34' const='yes' id='type-id-35'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-36'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-37'/>
    <function-decl name='mkdirp' mangled-name='mkdirp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/mkdirp.c' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkdirp'>
      <parameter type-id='type-id-6' name='d' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/mkdirp.c' line='50' column='1'/>
      <parameter type-id='type-id-32' name='mode' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/mkdirp.c' line='50' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='467' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='mbstowcs' filepath='/usr/include/stdlib.h' line='870' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='wcstombs' filepath='/usr/include/stdlib.h' line='873' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='mkdir' filepath='/usr/include/sys/stat.h' line='322' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='access' filepath='/usr/include/unistd.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='__rawmemchr' filepath='/usr/include/bits/string2.h' line='393' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-38'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-33'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/getexecname.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl' language='LANG_C89'>
    <typedef-decl name='ssize_t' type-id='type-id-39' filepath='/usr/include/sys/types.h' line='109' column='1' id='type-id-40'/>
    <typedef-decl name='__ssize_t' type-id='type-id-41' filepath='/usr/include/bits/types.h' line='181' column='1' id='type-id-39'/>
    <function-decl name='readlink' filepath='/usr/include/unistd.h' line='831' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <type-decl name='long int' size-in-bits='64' id='type-id-41'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/gethostid.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl' language='LANG_C89'>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-42'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-43'/>
    <function-decl name='get_system_hostid' mangled-name='get_system_hostid' filepath='os/linux/gethostid.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_system_hostid'>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='563' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='strtoull' filepath='/usr/include/stdlib.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-43'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='fscanf' filepath='/usr/include/stdio.h' line='425' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='read' filepath='/usr/include/unistd.h' line='360' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-44'/>
    <typedef-decl name='FILE' type-id='type-id-46' filepath='/usr/include/stdio.h' line='48' column='1' id='type-id-45'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/libio.h' line='246' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-3' visibility='default' filepath='/usr/include/libio.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-38' visibility='default' filepath='/usr/include/libio.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-38' visibility='default' filepath='/usr/include/libio.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-38' visibility='default' filepath='/usr/include/libio.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-38' visibility='default' filepath='/usr/include/libio.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-38' visibility='default' filepath='/usr/include/libio.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-38' visibility='default' filepath='/usr/include/libio.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-38' visibility='default' filepath='/usr/include/libio.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-38' visibility='default' filepath='/usr/include/libio.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-38' visibility='default' filepath='/usr/include/libio.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-38' visibility='default' filepath='/usr/include/libio.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-38' visibility='default' filepath='/usr/include/libio.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-47' visibility='default' filepath='/usr/include/libio.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-48' visibility='default' filepath='/usr/include/libio.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-3' visibility='default' filepath='/usr/include/libio.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-3' visibility='default' filepath='/usr/include/libio.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-49' visibility='default' filepath='/usr/include/libio.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-50' visibility='default' filepath='/usr/include/libio.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-51' visibility='default' filepath='/usr/include/libio.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-52' visibility='default' filepath='/usr/include/libio.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-53' visibility='default' filepath='/usr/include/libio.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-54' visibility='default' filepath='/usr/include/libio.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='__pad1' type-id='type-id-2' visibility='default' filepath='/usr/include/libio.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='__pad2' type-id='type-id-2' visibility='default' filepath='/usr/include/libio.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='__pad3' type-id='type-id-2' visibility='default' filepath='/usr/include/libio.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='__pad4' type-id='type-id-2' visibility='default' filepath='/usr/include/libio.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-15' visibility='default' filepath='/usr/include/libio.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-3' visibility='default' filepath='/usr/include/libio.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-55' visibility='default' filepath='/usr/include/libio.h' line='311' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-48'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-53'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-47'/>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='8' id='type-id-52'>
      <subrange length='1' type-id='type-id-22' id='type-id-58'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='160' id='type-id-55'>
      <subrange length='20' type-id='type-id-22' id='type-id-59'/>
    </array-type-def>
    <type-decl name='signed char' size-in-bits='8' id='type-id-51'/>
    <typedef-decl name='__off64_t' type-id='type-id-41' filepath='/usr/include/bits/types.h' line='141' column='1' id='type-id-54'/>
    <typedef-decl name='__off_t' type-id='type-id-41' filepath='/usr/include/bits/types.h' line='140' column='1' id='type-id-49'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-50'/>
    <class-decl name='_IO_marker' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/libio.h' line='161' column='1' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_next' type-id='type-id-47' visibility='default' filepath='/usr/include/libio.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_sbuf' type-id='type-id-48' visibility='default' filepath='/usr/include/libio.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_pos' type-id='type-id-3' visibility='default' filepath='/usr/include/libio.h' line='167' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_IO_lock_t' type-id='type-id-4' filepath='/usr/include/libio.h' line='155' column='1' id='type-id-56'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/getmntany.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-60' size-in-bits='192' id='type-id-61'>
      <subrange length='3' type-id='type-id-22' id='type-id-62'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='32880' id='type-id-63'>
      <subrange length='4110' type-id='type-id-22' id='type-id-64'/>
    </array-type-def>
    <class-decl name='mnttab' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='49' column='1' id='type-id-65'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-38' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-38' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-38' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-38' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='extmnttab' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='62' column='1' id='type-id-66'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-38' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-38' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-38' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-38' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_major' type-id='type-id-67' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_minor' type-id='type-id-67' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='68' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='stat64' size-in-bits='1152' is-struct='yes' visibility='default' filepath='/usr/include/bits/stat.h' line='119' column='1' id='type-id-68'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-69' visibility='default' filepath='/usr/include/bits/stat.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-70' visibility='default' filepath='/usr/include/bits/stat.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-71' visibility='default' filepath='/usr/include/bits/stat.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-31' visibility='default' filepath='/usr/include/bits/stat.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-72' visibility='default' filepath='/usr/include/bits/stat.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-73' visibility='default' filepath='/usr/include/bits/stat.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-3' visibility='default' filepath='/usr/include/bits/stat.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-69' visibility='default' filepath='/usr/include/bits/stat.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-49' visibility='default' filepath='/usr/include/bits/stat.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-74' visibility='default' filepath='/usr/include/bits/stat.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-75' visibility='default' filepath='/usr/include/bits/stat.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-76' visibility='default' filepath='/usr/include/bits/stat.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-76' visibility='default' filepath='/usr/include/bits/stat.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-76' visibility='default' filepath='/usr/include/bits/stat.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__unused' type-id='type-id-61' visibility='default' filepath='/usr/include/bits/stat.h' line='164' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__dev_t' type-id='type-id-19' filepath='/usr/include/bits/types.h' line='133' column='1' id='type-id-69'/>
    <typedef-decl name='__ino64_t' type-id='type-id-19' filepath='/usr/include/bits/types.h' line='137' column='1' id='type-id-70'/>
    <typedef-decl name='__nlink_t' type-id='type-id-19' filepath='/usr/include/bits/types.h' line='139' column='1' id='type-id-71'/>
    <typedef-decl name='__uid_t' type-id='type-id-33' filepath='/usr/include/bits/types.h' line='134' column='1' id='type-id-72'/>
    <typedef-decl name='__gid_t' type-id='type-id-33' filepath='/usr/include/bits/types.h' line='135' column='1' id='type-id-73'/>
    <typedef-decl name='__blksize_t' type-id='type-id-41' filepath='/usr/include/bits/types.h' line='162' column='1' id='type-id-74'/>
    <typedef-decl name='__blkcnt64_t' type-id='type-id-41' filepath='/usr/include/bits/types.h' line='168' column='1' id='type-id-75'/>
    <class-decl name='mntent' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/mntent.h' line='53' column='1' id='type-id-77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_fsname' type-id='type-id-38' visibility='default' filepath='/usr/include/mntent.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_dir' type-id='type-id-38' visibility='default' filepath='/usr/include/mntent.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_type' type-id='type-id-38' visibility='default' filepath='/usr/include/mntent.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_opts' type-id='type-id-38' visibility='default' filepath='/usr/include/mntent.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_freq' type-id='type-id-3' visibility='default' filepath='/usr/include/mntent.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_passno' type-id='type-id-3' visibility='default' filepath='/usr/include/mntent.h' line='60' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-78'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-80'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-81'/>
    <function-decl name='_sol_getmntent' mangled-name='_sol_getmntent' filepath='os/linux/getmntany.c' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_sol_getmntent'>
      <parameter type-id='type-id-44' name='fp' filepath='os/linux/getmntany.c' line='64' column='1'/>
      <parameter type-id='type-id-80' name='mgetp' filepath='os/linux/getmntany.c' line='64' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='getmntany' mangled-name='getmntany' filepath='os/linux/getmntany.c' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getmntany'>
      <parameter type-id='type-id-44' name='fp' filepath='os/linux/getmntany.c' line='51' column='1'/>
      <parameter type-id='type-id-80' name='mgetp' filepath='os/linux/getmntany.c' line='51' column='1'/>
      <parameter type-id='type-id-80' name='mrefp' filepath='os/linux/getmntany.c' line='51' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='getextmntent' mangled-name='getextmntent' filepath='os/linux/getmntany.c' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getextmntent'>
      <parameter type-id='type-id-6' name='path' filepath='os/linux/getmntany.c' line='106' column='1'/>
      <parameter type-id='type-id-78' name='entry' filepath='os/linux/getmntany.c' line='106' column='1'/>
      <parameter type-id='type-id-81' name='statbuf' filepath='os/linux/getmntany.c' line='106' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <var-decl name='buf' type-id='type-id-63' mangled-name='buf' visibility='default' filepath='os/linux/getmntany.c' line='44' column='1' elf-symbol-id='buf'/>
    <function-decl name='feof' filepath='/usr/include/stdio.h' line='828' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='getmntent_r' filepath='/usr/include/mntent.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-79'/>
    </function-decl>
    <function-decl name='__xstat64' filepath='/usr/include/sys/stat.h' line='435' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-81'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/time.h' line='120' column='1' id='type-id-76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-82' visibility='default' filepath='/usr/include/time.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-60' visibility='default' filepath='/usr/include/time.h' line='123' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-41' filepath='/usr/include/bits/types.h' line='184' column='1' id='type-id-60'/>
    <typedef-decl name='uint_t' type-id='type-id-33' filepath='../../lib/libspl/include/sys/stdtypes.h' line='33' column='1' id='type-id-67'/>
    <typedef-decl name='__time_t' type-id='type-id-41' filepath='/usr/include/bits/types.h' line='148' column='1' id='type-id-82'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/zone.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl' language='LANG_C89'>
    <typedef-decl name='zoneid_t' type-id='type-id-3' filepath='../../lib/libspl/include/sys/types.h' line='47' column='1' id='type-id-83'/>
    <function-decl name='getzoneid' mangled-name='getzoneid' filepath='os/linux/zone.c' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getzoneid'>
      <return type-id='type-id-83'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='page.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl' language='LANG_C89'>
    <function-decl name='spl_pagesize' mangled-name='spl_pagesize' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/page.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spl_pagesize'>
      <return type-id='type-id-15'/>
    </function-decl>
    <var-decl name='pagesize' type-id='type-id-15' mangled-name='pagesize' visibility='default' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/page.c' line='25' column='1' elf-symbol-id='pagesize'/>
    <function-decl name='sysconf' filepath='/usr/include/unistd.h' line='619' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-41'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='strlcat.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl' language='LANG_C89'>
    <function-decl name='strlcat' mangled-name='strlcat' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/strlcat.c' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcat'>
      <parameter type-id='type-id-38' name='dst' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/strlcat.c' line='39' column='1'/>
      <parameter type-id='type-id-6' name='src' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/strlcat.c' line='39' column='1'/>
      <parameter type-id='type-id-15' name='dstsize' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/strlcat.c' line='39' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='timestamp.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl' language='LANG_C89'>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/time.h' line='133' column='1' id='type-id-84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-3' visibility='default' filepath='/usr/include/time.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-3' visibility='default' filepath='/usr/include/time.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-3' visibility='default' filepath='/usr/include/time.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-3' visibility='default' filepath='/usr/include/time.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-3' visibility='default' filepath='/usr/include/time.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-3' visibility='default' filepath='/usr/include/time.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-3' visibility='default' filepath='/usr/include/time.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-3' visibility='default' filepath='/usr/include/time.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-3' visibility='default' filepath='/usr/include/time.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-41' visibility='default' filepath='/usr/include/time.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-6' visibility='default' filepath='/usr/include/time.h' line='147' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='time_t' type-id='type-id-82' filepath='/usr/include/time.h' line='75' column='1' id='type-id-85'/>
    <typedef-decl name='nl_item' type-id='type-id-3' filepath='/usr/include/nl_types.h' line='36' column='1' id='type-id-86'/>
    <qualified-type-def type-id='type-id-85' const='yes' id='type-id-87'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-88'/>
    <qualified-type-def type-id='type-id-84' const='yes' id='type-id-89'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-90'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-91'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-92'/>
    <function-decl name='print_timestamp' mangled-name='print_timestamp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/timestamp.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='print_timestamp'>
      <parameter type-id='type-id-67' name='timestamp_fmt' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libspl/timestamp.c' line='44' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='localtime' filepath='/usr/include/time.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-92'/>
    </function-decl>
    <function-decl name='strftime' filepath='/usr/include/time.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-90'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='time' filepath='/usr/include/time.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-85'/>
    </function-decl>
    <function-decl name='printf' filepath='/usr/include/stdio.h' line='362' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nl_langinfo' filepath='/usr/include/langinfo.h' line='583' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-38'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_alloc.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil' language='LANG_C89'>
    <type-decl name='char' size-in-bits='8' id='type-id-10'/>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-3'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-33'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-19'/>
    <type-decl name='variadic parameter type' id='type-id-94'/>
    <type-decl name='void' id='type-id-4'/>
    <typedef-decl name='size_t' type-id='type-id-19' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.8.5/include/stddef.h' line='212' column='1' id='type-id-15'/>
    <typedef-decl name='uint_t' type-id='type-id-33' filepath='../../lib/libspl/include/sys/stdtypes.h' line='33' column='1' id='type-id-67'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-95'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-38'/>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-8'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-6'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-2'/>
    <function-decl name='uu_zalloc' mangled-name='uu_zalloc' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_alloc.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_zalloc'>
      <parameter type-id='type-id-15' name='n' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_alloc.c' line='33' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_free' mangled-name='uu_free' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_alloc.c' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_free'>
      <parameter type-id='type-id-2' name='p' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_alloc.c' line='48' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_strdup' mangled-name='uu_strdup' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_alloc.c' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_strdup'>
      <parameter type-id='type-id-6' name='str' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_alloc.c' line='54' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='uu_strndup' mangled-name='uu_strndup' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_alloc.c' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_strndup'>
      <parameter type-id='type-id-6' name='s' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_alloc.c' line='74' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_alloc.c' line='74' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='uu_memdup' mangled-name='uu_memdup' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_alloc.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_memdup'>
      <parameter type-id='type-id-2' name='buf' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_alloc.c' line='96' column='1'/>
      <parameter type-id='type-id-15' name='sz' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_alloc.c' line='96' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_msprintf' mangled-name='uu_msprintf' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_alloc.c' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_msprintf'>
      <parameter type-id='type-id-6' name='format' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_alloc.c' line='108' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='465' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_set_error' mangled-name='uu_set_error' filepath='../../include/libuutil_impl.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_set_error'>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='482' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='395' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='strnlen' filepath='/usr/include/string.h' line='402' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='vsnprintf' filepath='/usr/include/stdio.h' line='390' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-95'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_avl.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='128' id='type-id-20'>
      <subrange length='2' type-id='type-id-22' id='type-id-23'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='320' id='type-id-96'>
      <subrange length='40' type-id='type-id-22' id='type-id-97'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='32' id='type-id-98'>
      <subrange length='4' type-id='type-id-22' id='type-id-99'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='512' id='type-id-100'>
      <subrange length='64' type-id='type-id-22' id='type-id-101'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='type-id-41'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-102'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-51'/>
    <type-decl name='sizetype' size-in-bits='64' id='type-id-22'/>
    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='192' id='type-id-103'>
      <subrange length='3' type-id='type-id-22' id='type-id-62'/>
    </array-type-def>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-104'/>
    <class-decl name='uu_avl_pool' size-in-bits='2176' is-struct='yes' visibility='default' filepath='../../include/libuutil_impl.h' line='154' column='1' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uap_next' type-id='type-id-106' visibility='default' filepath='../../include/libuutil_impl.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uap_prev' type-id='type-id-106' visibility='default' filepath='../../include/libuutil_impl.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uap_name' type-id='type-id-100' visibility='default' filepath='../../include/libuutil_impl.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='uap_nodeoffset' type-id='type-id-15' visibility='default' filepath='../../include/libuutil_impl.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='uap_objsize' type-id='type-id-15' visibility='default' filepath='../../include/libuutil_impl.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='uap_cmp' type-id='type-id-107' visibility='default' filepath='../../include/libuutil_impl.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='uap_debug' type-id='type-id-108' visibility='default' filepath='../../include/libuutil_impl.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='840'>
        <var-decl name='uap_last_index' type-id='type-id-108' visibility='default' filepath='../../include/libuutil_impl.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='uap_lock' type-id='type-id-109' visibility='default' filepath='../../include/libuutil_impl.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='uap_null_avl' type-id='type-id-110' visibility='default' filepath='../../include/libuutil_impl.h' line='165' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_avl_pool_t' type-id='type-id-105' filepath='../../include/libuutil.h' line='287' column='1' id='type-id-111'/>
    <typedef-decl name='uu_compare_fn_t' type-id='type-id-112' filepath='../../include/libuutil.h' line='159' column='1' id='type-id-113'/>
    <typedef-decl name='uint8_t' type-id='type-id-104' filepath='/usr/include/stdint.h' line='48' column='1' id='type-id-108'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-114' filepath='/usr/include/bits/pthreadtypes.h' line='128' column='1' id='type-id-109'/>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='90' column='1' id='type-id-114'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-115' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='125' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-96' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='126' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-41' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='127' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='92' column='1' id='type-id-115'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-3' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-33' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-3' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-33' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-3' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-102' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-102' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-116' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='type-id-117' filepath='/usr/include/bits/pthreadtypes.h' line='79' column='1' id='type-id-116'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='75' column='1' id='type-id-117'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-118' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-118' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='uu_avl' size-in-bits='960' is-struct='yes' visibility='default' filepath='../../include/libuutil_impl.h' line='137' column='1' id='type-id-119'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ua_next_enc' type-id='type-id-21' visibility='default' filepath='../../include/libuutil_impl.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ua_prev_enc' type-id='type-id-21' visibility='default' filepath='../../include/libuutil_impl.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ua_pool' type-id='type-id-106' visibility='default' filepath='../../include/libuutil_impl.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ua_parent_enc' type-id='type-id-21' visibility='default' filepath='../../include/libuutil_impl.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ua_debug' type-id='type-id-108' visibility='default' filepath='../../include/libuutil_impl.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='ua_index' type-id='type-id-108' visibility='default' filepath='../../include/libuutil_impl.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ua_tree' type-id='type-id-12' visibility='default' filepath='../../include/libuutil_impl.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ua_null_walk' type-id='type-id-120' visibility='default' filepath='../../include/libuutil_impl.h' line='147' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uintptr_t' type-id='type-id-19' filepath='/usr/include/stdint.h' line='122' column='1' id='type-id-21'/>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='146' column='1' id='type-id-12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-13' visibility='default' filepath='../../include/sys/avl_impl.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-14' visibility='default' filepath='../../include/sys/avl_impl.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-15' visibility='default' filepath='../../include/sys/avl_impl.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-16' visibility='default' filepath='../../include/sys/avl_impl.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_size' type-id='type-id-15' visibility='default' filepath='../../include/sys/avl_impl.h' line='151' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='90' column='1' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-20' visibility='default' filepath='../../include/sys/avl_impl.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-21' visibility='default' filepath='../../include/sys/avl_impl.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ulong_t' type-id='type-id-19' filepath='../../lib/libspl/include/sys/stdtypes.h' line='34' column='1' id='type-id-16'/>
    <class-decl name='uu_avl_walk' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/libuutil_impl.h' line='127' column='1' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uaw_next' type-id='type-id-122' visibility='default' filepath='../../include/libuutil_impl.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uaw_prev' type-id='type-id-122' visibility='default' filepath='../../include/libuutil_impl.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uaw_avl' type-id='type-id-123' visibility='default' filepath='../../include/libuutil_impl.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='uaw_next_result' type-id='type-id-2' visibility='default' filepath='../../include/libuutil_impl.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='uaw_dir' type-id='type-id-124' visibility='default' filepath='../../include/libuutil_impl.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='uaw_robust' type-id='type-id-108' visibility='default' filepath='../../include/libuutil_impl.h' line='134' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_avl_walk_t' type-id='type-id-121' filepath='../../include/libuutil.h' line='298' column='1' id='type-id-120'/>
    <typedef-decl name='uu_avl_t' type-id='type-id-119' filepath='../../include/libuutil.h' line='288' column='1' id='type-id-110'/>
    <typedef-decl name='int8_t' type-id='type-id-51' filepath='/usr/include/sys/types.h' line='194' column='1' id='type-id-124'/>
    <typedef-decl name='uint32_t' type-id='type-id-33' filepath='/usr/include/stdint.h' line='51' column='1' id='type-id-125'/>
    <typedef-decl name='uu_avl_node_t' type-id='type-id-126' filepath='../../include/libuutil.h' line='296' column='1' id='type-id-127'/>
    <class-decl name='uu_avl_node' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/libuutil.h' line='290' column='1' id='type-id-126'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uan_opaque' type-id='type-id-103' visibility='default' filepath='../../include/libuutil.h' line='292' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_walk_fn_t' type-id='type-id-18' filepath='../../include/libuutil.h' line='183' column='1' id='type-id-128'/>
    <typedef-decl name='uu_avl_index_t' type-id='type-id-21' filepath='../../include/libuutil.h' line='300' column='1' id='type-id-129'/>
    <typedef-decl name='avl_tree_t' type-id='type-id-12' filepath='../../include/sys/avl.h' line='119' column='1' id='type-id-7'/>
    <typedef-decl name='pthread_mutexattr_t' type-id='type-id-130' filepath='/usr/include/bits/pthreadtypes.h' line='134' column='1' id='type-id-131'/>
    <union-decl name='__anonymous_union__1' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='130' column='1' id='type-id-130'>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-98' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='132' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-3' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='133' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='avl_index_t' type-id='type-id-21' filepath='../../include/sys/avl.h' line='130' column='1' id='type-id-132'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-133'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-13'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-134'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-1'/>
    <qualified-type-def type-id='type-id-131' const='yes' id='type-id-135'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-136'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-137'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-138'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-139'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-106'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-123'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-122'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-107'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-140'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-141'/>
    <function-decl name='uu_avl_pool_create' mangled-name='uu_avl_pool_create' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='66' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_pool_create'>
      <parameter type-id='type-id-6' name='name' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='66' column='1'/>
      <parameter type-id='type-id-15' name='objsize' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='66' column='1'/>
      <parameter type-id='type-id-15' name='nodeoffset' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='66' column='1'/>
      <parameter type-id='type-id-107' name='compare_func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='67' column='1'/>
      <parameter type-id='type-id-125' name='flags' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='67' column='1'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='uu_avl_pool_destroy' mangled-name='uu_avl_pool_destroy' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_pool_destroy'>
      <parameter type-id='type-id-106' name='pp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='114' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_node_init' mangled-name='uu_avl_node_init' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_node_init'>
      <parameter type-id='type-id-2' name='base' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='138' column='1'/>
      <parameter type-id='type-id-139' name='np' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='138' column='1'/>
      <parameter type-id='type-id-106' name='pp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='138' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_node_fini' mangled-name='uu_avl_node_fini' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_node_fini'>
      <parameter type-id='type-id-2' name='base' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='163' column='1'/>
      <parameter type-id='type-id-139' name='np' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='163' column='1'/>
      <parameter type-id='type-id-106' name='pp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='163' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_create' mangled-name='uu_avl_create' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_create'>
      <parameter type-id='type-id-106' name='pp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='211' column='1'/>
      <parameter type-id='type-id-2' name='parent' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='211' column='1'/>
      <parameter type-id='type-id-125' name='flags' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='211' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='uu_avl_destroy' mangled-name='uu_avl_destroy' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_destroy'>
      <parameter type-id='type-id-123' name='ap' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='250' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_numnodes' mangled-name='uu_avl_numnodes' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_numnodes'>
      <parameter type-id='type-id-123' name='ap' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='279' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='uu_avl_first' mangled-name='uu_avl_first' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='285' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_first'>
      <parameter type-id='type-id-123' name='ap' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='285' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_avl_last' mangled-name='uu_avl_last' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_last'>
      <parameter type-id='type-id-123' name='ap' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='291' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_avl_next' mangled-name='uu_avl_next' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='297' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_next'>
      <parameter type-id='type-id-123' name='ap' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='297' column='1'/>
      <parameter type-id='type-id-2' name='node' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='297' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_avl_prev' mangled-name='uu_avl_prev' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='303' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_prev'>
      <parameter type-id='type-id-123' name='ap' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='303' column='1'/>
      <parameter type-id='type-id-2' name='node' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='303' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_avl_walk_start' mangled-name='uu_avl_walk_start' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='364' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk_start'>
      <parameter type-id='type-id-123' name='ap' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='364' column='1'/>
      <parameter type-id='type-id-125' name='flags' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='364' column='1'/>
      <return type-id='type-id-122'/>
    </function-decl>
    <function-decl name='uu_avl_walk_next' mangled-name='uu_avl_walk_next' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk_next'>
      <parameter type-id='type-id-122' name='wp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='384' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_avl_walk_end' mangled-name='uu_avl_walk_end' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='390' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk_end'>
      <parameter type-id='type-id-122' name='wp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='390' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_walk' mangled-name='uu_avl_walk' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='397' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk'>
      <parameter type-id='type-id-123' name='ap' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='397' column='1'/>
      <parameter type-id='type-id-140' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='397' column='1'/>
      <parameter type-id='type-id-2' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='397' column='1'/>
      <parameter type-id='type-id-125' name='flags' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='397' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_avl_remove' mangled-name='uu_avl_remove' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='422' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_remove'>
      <parameter type-id='type-id-123' name='ap' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='422' column='1'/>
      <parameter type-id='type-id-2' name='elem' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='422' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_teardown' mangled-name='uu_avl_teardown' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='458' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_teardown'>
      <parameter type-id='type-id-123' name='ap' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='458' column='1'/>
      <parameter type-id='type-id-141' name='cookie' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='458' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_avl_find' mangled-name='uu_avl_find' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='473' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_find'>
      <parameter type-id='type-id-123' name='ap' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='473' column='1'/>
      <parameter type-id='type-id-2' name='elem' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='473' column='1'/>
      <parameter type-id='type-id-2' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='473' column='1'/>
      <parameter type-id='type-id-138' name='out' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='473' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_avl_insert' mangled-name='uu_avl_insert' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='494' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_insert'>
      <parameter type-id='type-id-123' name='ap' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='494' column='1'/>
      <parameter type-id='type-id-2' name='elem' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='494' column='1'/>
      <parameter type-id='type-id-129' name='idx' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='494' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_nearest_next' mangled-name='uu_avl_nearest_next' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='528' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_nearest_next'>
      <parameter type-id='type-id-123' name='ap' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='528' column='1'/>
      <parameter type-id='type-id-129' name='idx' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='528' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_avl_nearest_prev' mangled-name='uu_avl_nearest_prev' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='538' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_nearest_prev'>
      <parameter type-id='type-id-123' name='ap' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='538' column='1'/>
      <parameter type-id='type-id-129' name='idx' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='538' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_avl_lockup' mangled-name='uu_avl_lockup' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_lockup'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_avl_release' mangled-name='uu_avl_release' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_avl.c' line='562' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_release'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_last' mangled-name='avl_last' filepath='../../include/sys/avl.h' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_last'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='avl_first' mangled-name='avl_first' filepath='../../include/sys/avl.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_first'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='avl_walk' mangled-name='avl_walk' filepath='../../include/sys/avl_impl.h' line='158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_walk'>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_check_name' mangled-name='uu_check_name' filepath='../../include/libuutil.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_check_name'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='strlcpy' mangled-name='strlcpy' filepath='../../lib/libspl/include/string.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcpy'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='pthread_mutex_init' filepath='/usr/include/pthread.h' line='743' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-137'/>
      <parameter type-id='type-id-136'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='756' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-137'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='767' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-137'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_panic' mangled-name='uu_panic' filepath='../../include/libuutil_impl.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_panic'>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' filepath='/usr/include/pthread.h' line='748' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-137'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='avl_create' mangled-name='avl_create' filepath='../../include/sys/avl.h' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_create'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_destroy' mangled-name='avl_destroy' filepath='../../include/sys/avl.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_numnodes' mangled-name='avl_numnodes' filepath='../../include/sys/avl.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_numnodes'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='avl_remove' mangled-name='avl_remove' filepath='../../include/sys/avl.h' line='260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_remove'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_destroy_nodes' mangled-name='avl_destroy_nodes' filepath='../../include/sys/avl.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy_nodes'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-141'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='avl_find' mangled-name='avl_find' filepath='../../include/sys/avl.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_find'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-133'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='avl_insert' mangled-name='avl_insert' filepath='../../include/sys/avl.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='avl_nearest' mangled-name='avl_nearest' filepath='../../include/sys/avl.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_nearest'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-132'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-18'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-112'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-3'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_dprintf.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='8' id='type-id-52'>
      <subrange length='1' type-id='type-id-22' id='type-id-58'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='160' id='type-id-55'>
      <subrange length='20' type-id='type-id-22' id='type-id-59'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-11'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-50'/>
    <typedef-decl name='uu_dprintf_t' type-id='type-id-142' filepath='../../include/libuutil.h' line='104' column='1' id='type-id-143'/>
    <class-decl name='uu_dprintf' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/libuutil_impl.h' line='49' column='1' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uud_name' type-id='type-id-38' visibility='default' filepath='../../include/libuutil_impl.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uud_severity' type-id='type-id-144' visibility='default' filepath='../../include/libuutil_impl.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='uud_flags' type-id='type-id-67' visibility='default' filepath='../../include/libuutil_impl.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_dprintf_severity_t' type-id='type-id-145' filepath='../../include/libuutil.h' line='113' column='1' id='type-id-144'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/libuutil.h' line='106' column='1' id='type-id-145'>
      <underlying-type type-id='type-id-11'/>
      <enumerator name='UU_DPRINTF_SILENT' value='0'/>
      <enumerator name='UU_DPRINTF_FATAL' value='1'/>
      <enumerator name='UU_DPRINTF_WARNING' value='2'/>
      <enumerator name='UU_DPRINTF_NOTICE' value='3'/>
      <enumerator name='UU_DPRINTF_INFO' value='4'/>
      <enumerator name='UU_DPRINTF_DEBUG' value='5'/>
    </enum-decl>
    <typedef-decl name='FILE' type-id='type-id-46' filepath='/usr/include/stdio.h' line='48' column='1' id='type-id-45'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/libio.h' line='246' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-3' visibility='default' filepath='/usr/include/libio.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-38' visibility='default' filepath='/usr/include/libio.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-38' visibility='default' filepath='/usr/include/libio.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-38' visibility='default' filepath='/usr/include/libio.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-38' visibility='default' filepath='/usr/include/libio.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-38' visibility='default' filepath='/usr/include/libio.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-38' visibility='default' filepath='/usr/include/libio.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-38' visibility='default' filepath='/usr/include/libio.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-38' visibility='default' filepath='/usr/include/libio.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-38' visibility='default' filepath='/usr/include/libio.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-38' visibility='default' filepath='/usr/include/libio.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-38' visibility='default' filepath='/usr/include/libio.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-47' visibility='default' filepath='/usr/include/libio.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-48' visibility='default' filepath='/usr/include/libio.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-3' visibility='default' filepath='/usr/include/libio.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-3' visibility='default' filepath='/usr/include/libio.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-49' visibility='default' filepath='/usr/include/libio.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-50' visibility='default' filepath='/usr/include/libio.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-51' visibility='default' filepath='/usr/include/libio.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-52' visibility='default' filepath='/usr/include/libio.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-53' visibility='default' filepath='/usr/include/libio.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-54' visibility='default' filepath='/usr/include/libio.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='__pad1' type-id='type-id-2' visibility='default' filepath='/usr/include/libio.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='__pad2' type-id='type-id-2' visibility='default' filepath='/usr/include/libio.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='__pad3' type-id='type-id-2' visibility='default' filepath='/usr/include/libio.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='__pad4' type-id='type-id-2' visibility='default' filepath='/usr/include/libio.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-15' visibility='default' filepath='/usr/include/libio.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-3' visibility='default' filepath='/usr/include/libio.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-55' visibility='default' filepath='/usr/include/libio.h' line='311' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/libio.h' line='161' column='1' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_next' type-id='type-id-47' visibility='default' filepath='/usr/include/libio.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_sbuf' type-id='type-id-48' visibility='default' filepath='/usr/include/libio.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_pos' type-id='type-id-3' visibility='default' filepath='/usr/include/libio.h' line='167' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__off_t' type-id='type-id-41' filepath='/usr/include/bits/types.h' line='140' column='1' id='type-id-49'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-4' filepath='/usr/include/libio.h' line='155' column='1' id='type-id-56'/>
    <typedef-decl name='__off64_t' type-id='type-id-41' filepath='/usr/include/bits/types.h' line='141' column='1' id='type-id-54'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-44'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-48'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-53'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-47'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-146'/>
    <function-decl name='uu_dprintf_create' mangled-name='uu_dprintf_create' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_dprintf.c' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_dprintf_create'>
      <parameter type-id='type-id-6' name='name' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_dprintf.c' line='67' column='1'/>
      <parameter type-id='type-id-144' name='severity' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_dprintf.c' line='67' column='1'/>
      <parameter type-id='type-id-67' name='flags' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_dprintf.c' line='68' column='1'/>
      <return type-id='type-id-146'/>
    </function-decl>
    <function-decl name='uu_dprintf' mangled-name='uu_dprintf' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_dprintf.c' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_dprintf'>
      <parameter type-id='type-id-146' name='D' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_dprintf.c' line='99' column='1'/>
      <parameter type-id='type-id-144' name='severity' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_dprintf.c' line='99' column='1'/>
      <parameter type-id='type-id-6' name='format' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_dprintf.c' line='100' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_dprintf_destroy' mangled-name='uu_dprintf_destroy' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_dprintf.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_dprintf_destroy'>
      <parameter type-id='type-id-146' name='D' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_dprintf.c' line='118' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_dprintf_getname' mangled-name='uu_dprintf_getname' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_dprintf.c' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_dprintf_getname'>
      <parameter type-id='type-id-146' name='D' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_dprintf.c' line='127' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__strdup' filepath='/usr/include/bits/string2.h' line='1301' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='dcgettext' filepath='/usr/include/libintl.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='fprintf' filepath='/usr/include/stdio.h' line='356' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='vfprintf' filepath='/usr/include/stdio.h' line='371' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-95'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_list.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='128' id='type-id-147'>
      <subrange length='2' type-id='type-id-22' id='type-id-23'/>
    </array-type-def>
    <class-decl name='uu_list_pool' size-in-bits='2112' is-struct='yes' visibility='default' filepath='../../include/libuutil_impl.h' line='108' column='1' id='type-id-148'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ulp_next' type-id='type-id-149' visibility='default' filepath='../../include/libuutil_impl.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ulp_prev' type-id='type-id-149' visibility='default' filepath='../../include/libuutil_impl.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ulp_name' type-id='type-id-100' visibility='default' filepath='../../include/libuutil_impl.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ulp_nodeoffset' type-id='type-id-15' visibility='default' filepath='../../include/libuutil_impl.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ulp_objsize' type-id='type-id-15' visibility='default' filepath='../../include/libuutil_impl.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ulp_cmp' type-id='type-id-107' visibility='default' filepath='../../include/libuutil_impl.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='ulp_debug' type-id='type-id-108' visibility='default' filepath='../../include/libuutil_impl.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='840'>
        <var-decl name='ulp_last_index' type-id='type-id-108' visibility='default' filepath='../../include/libuutil_impl.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='ulp_lock' type-id='type-id-109' visibility='default' filepath='../../include/libuutil_impl.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='ulp_null_list' type-id='type-id-150' visibility='default' filepath='../../include/libuutil_impl.h' line='119' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_list_pool_t' type-id='type-id-148' filepath='../../include/libuutil.h' line='188' column='1' id='type-id-151'/>
    <class-decl name='uu_list' size-in-bits='896' is-struct='yes' visibility='default' filepath='../../include/libuutil_impl.h' line='88' column='1' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ul_next_enc' type-id='type-id-21' visibility='default' filepath='../../include/libuutil_impl.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ul_prev_enc' type-id='type-id-21' visibility='default' filepath='../../include/libuutil_impl.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ul_pool' type-id='type-id-149' visibility='default' filepath='../../include/libuutil_impl.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ul_parent_enc' type-id='type-id-21' visibility='default' filepath='../../include/libuutil_impl.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ul_offset' type-id='type-id-15' visibility='default' filepath='../../include/libuutil_impl.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ul_numnodes' type-id='type-id-15' visibility='default' filepath='../../include/libuutil_impl.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ul_debug' type-id='type-id-108' visibility='default' filepath='../../include/libuutil_impl.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='392'>
        <var-decl name='ul_sorted' type-id='type-id-108' visibility='default' filepath='../../include/libuutil_impl.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='400'>
        <var-decl name='ul_index' type-id='type-id-108' visibility='default' filepath='../../include/libuutil_impl.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ul_null_node' type-id='type-id-153' visibility='default' filepath='../../include/libuutil_impl.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ul_null_walk' type-id='type-id-154' visibility='default' filepath='../../include/libuutil_impl.h' line='101' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_list_node_impl_t' type-id='type-id-155' filepath='../../include/libuutil_impl.h' line='76' column='1' id='type-id-153'/>
    <class-decl name='uu_list_node_impl' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/libuutil_impl.h' line='73' column='1' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uln_next' type-id='type-id-156' visibility='default' filepath='../../include/libuutil_impl.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uln_prev' type-id='type-id-156' visibility='default' filepath='../../include/libuutil_impl.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='uu_list_walk' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/libuutil_impl.h' line='78' column='1' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ulw_next' type-id='type-id-158' visibility='default' filepath='../../include/libuutil_impl.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ulw_prev' type-id='type-id-158' visibility='default' filepath='../../include/libuutil_impl.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ulw_list' type-id='type-id-159' visibility='default' filepath='../../include/libuutil_impl.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ulw_dir' type-id='type-id-124' visibility='default' filepath='../../include/libuutil_impl.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='ulw_robust' type-id='type-id-108' visibility='default' filepath='../../include/libuutil_impl.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ulw_next_result' type-id='type-id-160' visibility='default' filepath='../../include/libuutil_impl.h' line='85' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_list_walk_t' type-id='type-id-157' filepath='../../include/libuutil.h' line='195' column='1' id='type-id-154'/>
    <typedef-decl name='uu_list_t' type-id='type-id-152' filepath='../../include/libuutil.h' line='189' column='1' id='type-id-150'/>
    <typedef-decl name='uu_list_node_t' type-id='type-id-161' filepath='../../include/libuutil.h' line='193' column='1' id='type-id-162'/>
    <class-decl name='uu_list_node' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/libuutil.h' line='191' column='1' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uln_opaque' type-id='type-id-147' visibility='default' filepath='../../include/libuutil.h' line='192' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_list_index_t' type-id='type-id-21' filepath='../../include/libuutil.h' line='197' column='1' id='type-id-163'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-164'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-156'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-160'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-165'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-149'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-159'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-158'/>
    <function-decl name='uu_list_pool_create' mangled-name='uu_list_pool_create' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_pool_create'>
      <parameter type-id='type-id-6' name='name' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='63' column='1'/>
      <parameter type-id='type-id-15' name='objsize' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='63' column='1'/>
      <parameter type-id='type-id-15' name='nodeoffset' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='64' column='1'/>
      <parameter type-id='type-id-107' name='compare_func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='64' column='1'/>
      <parameter type-id='type-id-125' name='flags' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='64' column='1'/>
      <return type-id='type-id-149'/>
    </function-decl>
    <function-decl name='uu_list_pool_destroy' mangled-name='uu_list_pool_destroy' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_pool_destroy'>
      <parameter type-id='type-id-149' name='pp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='110' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_node_init' mangled-name='uu_list_node_init' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_node_init'>
      <parameter type-id='type-id-2' name='base' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='133' column='1'/>
      <parameter type-id='type-id-165' name='np_arg' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='133' column='1'/>
      <parameter type-id='type-id-149' name='pp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='133' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_node_fini' mangled-name='uu_list_node_fini' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_node_fini'>
      <parameter type-id='type-id-2' name='base' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='157' column='1'/>
      <parameter type-id='type-id-165' name='np_arg' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='157' column='1'/>
      <parameter type-id='type-id-149' name='pp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='157' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_create' mangled-name='uu_list_create' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_create'>
      <parameter type-id='type-id-149' name='pp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='180' column='1'/>
      <parameter type-id='type-id-2' name='parent' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='180' column='1'/>
      <parameter type-id='type-id-125' name='flags' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='180' column='1'/>
      <return type-id='type-id-159'/>
    </function-decl>
    <function-decl name='uu_list_destroy' mangled-name='uu_list_destroy' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_destroy'>
      <parameter type-id='type-id-159' name='lp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='231' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_insert' mangled-name='uu_list_insert' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='292' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_insert'>
      <parameter type-id='type-id-159' name='lp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='292' column='1'/>
      <parameter type-id='type-id-2' name='elem' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='292' column='1'/>
      <parameter type-id='type-id-163' name='idx' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='292' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_find' mangled-name='uu_list_find' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_find'>
      <parameter type-id='type-id-159' name='lp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='315' column='1'/>
      <parameter type-id='type-id-2' name='elem' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='315' column='1'/>
      <parameter type-id='type-id-2' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='315' column='1'/>
      <parameter type-id='type-id-164' name='out' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='315' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_list_nearest_next' mangled-name='uu_list_nearest_next' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='348' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_nearest_next'>
      <parameter type-id='type-id-159' name='lp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='348' column='1'/>
      <parameter type-id='type-id-163' name='idx' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='348' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_list_nearest_prev' mangled-name='uu_list_nearest_prev' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='373' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_nearest_prev'>
      <parameter type-id='type-id-159' name='lp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='373' column='1'/>
      <parameter type-id='type-id-163' name='idx' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='373' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_list_walk_start' mangled-name='uu_list_walk_start' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='456' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk_start'>
      <parameter type-id='type-id-159' name='lp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='456' column='1'/>
      <parameter type-id='type-id-125' name='flags' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='456' column='1'/>
      <return type-id='type-id-158'/>
    </function-decl>
    <function-decl name='uu_list_walk_next' mangled-name='uu_list_walk_next' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='476' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk_next'>
      <parameter type-id='type-id-158' name='wp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='476' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_list_walk_end' mangled-name='uu_list_walk_end' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='488' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk_end'>
      <parameter type-id='type-id-158' name='wp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='488' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_walk' mangled-name='uu_list_walk' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='495' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk'>
      <parameter type-id='type-id-159' name='lp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='495' column='1'/>
      <parameter type-id='type-id-140' name='func' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='495' column='1'/>
      <parameter type-id='type-id-2' name='private' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='495' column='1'/>
      <parameter type-id='type-id-125' name='flags' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='495' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_list_remove' mangled-name='uu_list_remove' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='540' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_remove'>
      <parameter type-id='type-id-159' name='lp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='540' column='1'/>
      <parameter type-id='type-id-2' name='elem' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='540' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_insert_before' mangled-name='uu_list_insert_before' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='598' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_insert_before'>
      <parameter type-id='type-id-159' name='lp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='598' column='1'/>
      <parameter type-id='type-id-2' name='target' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='598' column='1'/>
      <parameter type-id='type-id-2' name='elem' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='598' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_list_insert_after' mangled-name='uu_list_insert_after' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='624' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_insert_after'>
      <parameter type-id='type-id-159' name='lp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='624' column='1'/>
      <parameter type-id='type-id-2' name='target' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='624' column='1'/>
      <parameter type-id='type-id-2' name='elem' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='624' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_list_numnodes' mangled-name='uu_list_numnodes' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='650' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_numnodes'>
      <parameter type-id='type-id-159' name='lp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='650' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='uu_list_first' mangled-name='uu_list_first' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='656' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_first'>
      <parameter type-id='type-id-159' name='lp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='656' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_list_teardown' mangled-name='uu_list_teardown' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='580' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_teardown'>
      <parameter type-id='type-id-159' name='lp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='580' column='1'/>
      <parameter type-id='type-id-141' name='cookie' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='580' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_list_last' mangled-name='uu_list_last' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='665' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_last'>
      <parameter type-id='type-id-159' name='lp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='665' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_list_next' mangled-name='uu_list_next' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='674' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_next'>
      <parameter type-id='type-id-159' name='lp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='674' column='1'/>
      <parameter type-id='type-id-2' name='elem' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='674' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_list_prev' mangled-name='uu_list_prev' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='685' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_prev'>
      <parameter type-id='type-id-159' name='lp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='685' column='1'/>
      <parameter type-id='type-id-2' name='elem' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='685' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_list_lockup' mangled-name='uu_list_lockup' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='699' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_lockup'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_list_release' mangled-name='uu_list_release' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_list.c' line='710' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_release'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_misc.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil' language='LANG_C89'>
    <typedef-decl name='pthread_key_t' type-id='type-id-33' filepath='/usr/include/bits/pthreadtypes.h' line='164' column='1' id='type-id-166'/>
    <typedef-decl name='pthread_t' type-id='type-id-19' filepath='/usr/include/bits/pthreadtypes.h' line='60' column='1' id='type-id-167'/>
    <qualified-type-def type-id='type-id-50' const='yes' id='type-id-168'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-169'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-170'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-171'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-172'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-174'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-176'/>
    <function-decl name='uu_error' mangled-name='uu_error' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_misc.c' line='102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_error'>
      <return type-id='type-id-125'/>
    </function-decl>
    <function-decl name='uu_strerror' mangled-name='uu_strerror' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_misc.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_strerror'>
      <parameter type-id='type-id-125' name='code' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_misc.c' line='118' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_dump' mangled-name='uu_dump' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_misc.c' line='260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_dump'>
      <parameter type-id='type-id-44' name='out' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_misc.c' line='260' column='1'/>
      <parameter type-id='type-id-6' name='prefix' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_misc.c' line='260' column='1'/>
      <parameter type-id='type-id-2' name='buf' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_misc.c' line='260' column='1'/>
      <parameter type-id='type-id-15' name='len' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_misc.c' line='260' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_setspecific' filepath='/usr/include/pthread.h' line='1116' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-166'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='pthread_key_create' filepath='/usr/include/pthread.h' line='1105' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-172'/>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='pthread_getspecific' filepath='/usr/include/pthread.h' line='1113' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-166'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/bits/errno.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-171'/>
    </function-decl>
    <function-decl name='pthread_self' filepath='/usr/include/pthread.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='pause' filepath='/usr/include/unistd.h' line='469' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='abort' filepath='/usr/include/stdlib.h' line='514' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_atfork' filepath='/usr/include/pthread.h' line='1139' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-174'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-170'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-173'>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-175'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_open.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil' language='LANG_C89'>
    <typedef-decl name='clockid_t' type-id='type-id-177' filepath='/usr/include/time.h' line='91' column='1' id='type-id-178'/>
    <typedef-decl name='__clockid_t' type-id='type-id-3' filepath='/usr/include/bits/types.h' line='156' column='1' id='type-id-177'/>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/time.h' line='120' column='1' id='type-id-76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-82' visibility='default' filepath='/usr/include/time.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-60' visibility='default' filepath='/usr/include/time.h' line='123' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__time_t' type-id='type-id-41' filepath='/usr/include/bits/types.h' line='148' column='1' id='type-id-82'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-41' filepath='/usr/include/bits/types.h' line='184' column='1' id='type-id-60'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-179'/>
    <function-decl name='uu_open_tmp' mangled-name='uu_open_tmp' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_open.c' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_open_tmp'>
      <parameter type-id='type-id-6' name='dir' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_open.c' line='47' column='1'/>
      <parameter type-id='type-id-67' name='uflags' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_open.c' line='47' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='clock_gettime' filepath='/usr/include/time.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-178'/>
      <parameter type-id='type-id-179'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='snprintf' filepath='/usr/include/stdio.h' line='386' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='unlink' filepath='/usr/include/unistd.h' line='848' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_pname.c' comp-dir-path='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil' language='LANG_C89'>
    <function-decl name='uu_exit_ok' mangled-name='uu_exit_ok' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_pname.c' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_exit_ok'>
      <return type-id='type-id-171'/>
    </function-decl>
    <function-decl name='uu_exit_fatal' mangled-name='uu_exit_fatal' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_pname.c' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_exit_fatal'>
      <return type-id='type-id-171'/>
    </function-decl>
    <function-decl name='uu_exit_usage' mangled-name='uu_exit_usage' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_pname.c' line='66' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_exit_usage'>
      <return type-id='type-id-171'/>
    </function-decl>
    <function-decl name='uu_alt_exit' mangled-name='uu_alt_exit' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_pname.c' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_alt_exit'>
      <parameter type-id='type-id-3' name='profile' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_pname.c' line='72' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='uu_vwarn' mangled-name='uu_vwarn' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_pname.c' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_vwarn'>
      <parameter type-id='type-id-6' name='format' filepath='/home/will/git/gh/wca/zfsonlinux-zfs/lib/libuutil/uu_pname.c' line='101' column='1'/>
